[
    {
        "id": 1,
        "name": "Dr. Shah Muhammad Ali",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Shah Muhammad Ali graduated from Sir Salimullah Medical College & Mitford Hospital in 1982. After his internship, he worked as medical officer in The Islamic Republic of Iran for four years. After coming back in 1988, he joined in Holy Family Red Crescent Medical College Hospital in the department of Anesthesiology. He obtained advanced specialized training from the Institute of Post Graduate Medicine & Research (IPGMR) and completed his Diploma in Anesthesiology in 1991 and FCPS in 1993. Dr. Shah Muhammad Ali became a Consultant in the year 1994 in Holy Family Red Crescent Medical College Hospital and later he worked as Senior Consultant & Associate Professor of Anesthesiology & the Head of the Department of Intensive Care Medicine from the year 2001. He was also an examiner of BCPS and Instructor in Nepal and Philippines for a USAID sponsored course on hospital management, emergencies and disaster management. He is working Square Hospital as Senior Consultant, Anesthesiology. Experience: More than 25 years",
        "image": null
    },
    {
        "id": 2,
        "name": "Dr. Tahmina Banu",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Tahmina Banu MBBS, DA, MD is a medical graduate from Dhaka Medical College. After completion of her internship she started her carrier and served various capacities for last 13 years across the country. She has achieved advanced training on Regional Anesthesia and Intensive Care Management and is well trained in anesthesia for neuro-surgical cases as well. She also worked as a member of Renal Transplant Team.",
        "image": null
    },
    {
        "id": 3,
        "name": "Dr. Bhabesh Chandra Mondal",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Bhabesh Chandra Mondal graduated from Sir Salimullah Medical College in 1992. After his internship he worked as Honorary Resident Anesthetist in Mitford Hospital. As medical officer he joined BIRDEM in 1996, completed Diploma in Anesthesiology (DA) and then appointed as Registrar, Anesthesiology. In 2004, Dr. Bhabesh obtained his fellowship (FCPS) in Anesthesia from the Bangladesh College of Physicians and Surgeons (BCPS). Dr. Bhabesh worked as Jr. Consultant then as Assistant Professor of Anesthesiology in Ibrahim Medical College & BIRDEM. He also worked in Ibrahim Cardiac Hospital & Research Institute in the department of Cardiac Anesthesiology & Surgical ICU as Registrar and Junior Consultant till February, 2010. He published scientific articles in different journals. He joins Square Hospital as Consultant, Cardiac Anesthesiology. Experience: More than 15 years",
        "image": null
    },
    {
        "id": 4,
        "name": "Dr. Ranadhir Kumar Kundu",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Ranadhir Kumar Kundu graduated from Sher-e-Bangla Medical College, Barisal in 1985. After completion of internship he worked as medical officer in different government hospitals in Bangladesh. In 1995 he was appointed as Lecturer of Anatomy at Faridpur Medical College. Afterwards, he worked at BSMMU, Sir Salimullah Medical College Hospital and Dhaka Medical College Hospital. After achieving MD degree from BSMMU in 2004, Dr. Ranadhir worked as Registrar in Cardiac Anesthesia at National Institute of Cardiovascular Diseases and Hospital (NICVD), Dhaka till 2007 and conducted a good number of cardiac anesthesias both open and closed heart surgery. He executed neuroanesthesia for all sorts of routine and emergency neurosurgical and neurotrauma patients from the age of day one to ninety years old with multiple co-morbidities. ? Dr. Ranadhir Kumar participated in different international & national conferences and seminars of anesthesia and critical care at home & abroad. He published several scientific articles in different scientific journals. He is the member of BSA and BSSP. His working area of interest is in Neuro-anesthesia and Neuro ICU.",
        "image": null
    },
    {
        "id": 5,
        "name": "Dr. Md. Quamrul Islam",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Md. Quamrul Islam graduated from Mymensingh Medical College in 1993. After completion of his internship, he joined National Institute of Chest Disease and Hospital. He worked as Anesthesiologist in the Dept. of Anesthesiology of Dhaka Medical College Hospital and Sir Salimullah Medical College and Mitford Hospital. He is a student of the first batch of MD (Anesthesiology) of Dhaka Medical College and achieved MD (Anesthesiology) degree in 2007. Dr. Md. Quamrul Islam joined National Institute of Cardiovascular Diseases and Hospital and conducted a good number of cardiac anesthesias for both open and closed heart surgery and different types of vascular surgery. He got advanced training in Pediatric Anesthesia from Dhaka Shishu Hospital and Apollo Hospital, Kolkata, India. He participated in different international and national conferences on Anesthesia and Pain Medicine in home and abroad. He joined Square Hospital in 2010.",
        "image": null
    },
    {
        "id": 6,
        "name": "Prof. Dr. Md. Zulfiqar Hasan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Professor Zulfiqar Hasan obtained MBBS degree from Chittagong Medical College in 1980. Then he joined in Government service in 1981 after completion of internship in the same institute. He has got vast experience of working in different government institutes namely IPGMR, BSMMU, Dhaka Medical College Hospital, Sir Salimullah Meical College and Mitford Hospital, NICVD, NIO, NITOR, Shaheed Suhrawardi Medical College and Hospital. His last appointment in Government service was in National Institute of Neuroscience and Hospital as the founder Head of the Anesthesia Department. In the tenure of his long service period he was exposed to different specialties of Anesthesiology in different capacities. He has got vast experience in all sorts of General & Regional Anesthetic techniques with keen interest in Neuro and Paediatric anesthesia. He joined at Square Hospital as Senior Consultant, Anesthesiology in September 2015.",
        "image": null
    },
    {
        "id": 7,
        "name": "Dr. Istaque Ahmed Milton",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Istaque Ahmed Milton graduated from Community Based Medical College, Bangladesh in 2005. After completion of internship, he got academic training in Anesthesia, Pain and ICU from BSMMU and Dhaka Medical College Hospital. In this process, he passed Diploma in Anesthesia (DA) from DMC,H and FCPS from BCPS. Dr. Istaque Ahmed Milton started his career as Resident, Cardiac Anesthesia in Ibrahim Cardiac Hospital. Later he worked for some other reputed institutes, namely Medical College for Women and Hospital, Square Hospitals Limited and Dr. Sirajul Islam Medical College Hospital where he successfully handled different level of responsibilities. He is specially trained in delicate Anesthesia fields like Cardiac Anesthesia, Pediatric Anesthesia, Neuro-anesthesia and ICU management. Now he serves as Associate Consultant, Anesthesiology.",
        "image": null
    },
    {
        "id": 8,
        "name": "Prof. Brig. Gen. Faruk Ahmed (Retd.)",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Ahmed graduated from Rajshahi Medical College and started his career as general duty medical officer in Combined Military Hospitals under defense ministry. Then he underwent full time residential training in Clinical Pathology at Armed Forces institute of Pathology and successfully obtained a postgraduate diploma. Subsequently he achieved MCPS Degree in clinical pathology. Prof. Dr. Faruk Ahmed pursued FCPS degree in Hematology from Bangladesh College of Physicians and Surgeons (BCPS). He also achieved advanced training on Automated Hematology in Pakistan. In his professional life, he gained a wide exposure in the field of hematology. He has special interest in Clinical & Diagnostic Hematology. Dr. Faruk actively participated in many seminars and symposiums in home, abroad, and presented papers in his respective field. He is an examiner of FCPS in Hematology. He has published a number of articles in reputed medical journals and appreciated by the physicians.",
        "image": null
    },
    {
        "id": 9,
        "name": "Dr. Mosaddeque Ahmed",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mosaddeque Ahmed completed his graduation from Sylhet Medical College. After finishing his internship he traveled Zambia for extensive training in medicine from the University Teaching Hospital, Lusaka, Zambia. In 1986, he moved to Saudi Arabia to join King Fahad Hospital, KSA. King Fahad Hospital is a tertiary care hospital and medical college in Madina province which dialysis centre is one of the largest centers in the Middle East with a capacity of 450 patients on dialysis. Dr. Mosaddeque was actively involved in kidney transplantation program in King Fahad Hospital. He was awarded BCLS certificate from CPR Training Center, Madina (in affiliation with Saudi & American Heart Association). Lately he worked as Associate Professor in the department of Nephrology of Uttara Adhunik Medical College Hospital, Dhaka. Dr. Mosaddeque completed MRCP degree from the Royal College of Physicians, United Kingdom. He is the qualified physician of United States Medical Licensing Examination from 1996. Dr. Mosaddeque has wide experience in different modalities of kidney replacement therapy including plasmapheresis. He has many papers published in national and international journals. He attended and presented papers in many national and international conferences. He possesses 25 years of experience in the field of Nephrology.",
        "image": null
    },
    {
        "id": 10,
        "name": "Prof. Dr. M. A. Rashid",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. M. A. Rashid completed his graduation from Mymensingh Medical College under Dhaka University in 1986. After completing graduation he served in different government medical institutes and hospitals across the country under Ministry of Health and Family Welfare. He then dedicated himself in training and in 1996 he obtained his fellowship FCPS (Physical Medicine) from Bangladesh College of Physicians and Surgeons (BCPS). Dr. M. A. Rashid worked in BSMMU and Dhaka Medical College Hospital. In 1996 he joined NITOR (Pongu Hospital) as Assistant Professor and became Associate Professor in the year 2003. Then he worked as Associate Professor of Physical Medicine in Sir Salimullah Medical College & Mitford Hospital up to 2009. Later, Dr. M. A. Rashid joined as Professor and Vice Principal in Shaheed Suhrawardy Medical College up to June, 2015. Then he performed as Principal and Professor of Physical Medicine in Mugda Medical College up to September, 2015. Now he is working as Director of Medical Education and Health Manpower Development, DhHS from September 2015. Dr. M. A. Rashid visited Aga Khan Medical University in Pakistan, Bummungard Hospital in Thailand, Yangun Medical College, Myanmar and CMC, Vellore, India, USA, UK, Italy, Germany and France etc. to achieve higher knowledge in Physical Medicine and Rehabilitation. Dr. Rashid possess more than 22 years of experience in the field of Physical Medicine.",
        "image": null
    },
    {
        "id": 11,
        "name": "Dr. Subbian Esakkimuthu Asary",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Subbian completed his medical graduation from Sri Ramachandra Medical College & Research Institute Chennai, India. He obtained his Post graduate degree (MD, PMR) from Christian Medical College Vellore under Dr. MGR Tamilnadu Medical University, Chennai, India. He is a renowned consultant who has acquired the necessary expertise at tertiary care level in Christian Medical College, Vellore, India. He has achieved advanced training in the field of physical medicine and rehabilitation. He served as an Assistant Professor in CMCH Vellore.",
        "image": null
    },
    {
        "id": 12,
        "name": "Mrs. Sharmin Haque",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Mrs. Sharmin Haque completed her MSc & M Phil in clinical psychology from University of Dhaka. She has done majority of her training from Department of Clinical Psychology, University of Dhaka and Psychiatric Clinic (New Delia) in India. Before joining Square Hospital, she worked in different hospitals and clinic such as Department of Psychiatry (BSMMU), Headache Clinic (DMCH), Psychiatric Department (SSMCH), Student Guidance and Counseling Centre (TSC), Centre for Rehabilitation of Drug Addiction (CREA), Diabetic Care & Education centre (NHN) and Dhaka Community Hospital.",
        "image": null
    },
    {
        "id": 13,
        "name": "Dr. Rehnuma Jahan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Rehnuma Jahan obtained MBBS from Sylhet M A G Osmani Medical College and completed MS in Obstetrics & Gynecology from BSMMU. She worked at BIRDEM, Sylhet MAG Omani Medical College, Shaheed Sohrawardi Medical College under Ministry of Health and Family Welfare, Bangladesh in various capacities. Dr. Rehnuma took special training in Artificial Reproductive technique & laparoscopy from India & Singapore. She performed in the department of Obstetrics & Gynecology as well as Infertility at Apollo Hospital, Dhaka. Dr. Rehnuma is working at Square Hospital as a Consultant of department of Obstetrics & Gynecology & Square Fertility Centre from 2008. She attended many seminars & conferences on ObsGyn & Infertility within country & abroad.",
        "image": null
    },
    {
        "id": 14,
        "name": "Dr. Shagufta Afreen Azhar",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Shagufta completed her graduation from Dhaka Medical College, University of Dhaka in 1992. She has got Fellow of College of Physician and Surgeons (FCPS) in Radiology and Imaging from Bangladesh College of Physicians and Surgeons (BCPS) in 2006. Earlier she started her career from Dhaka Medical College Hospital as a lecturer, Anatomy in 1998. She then worked as an IMO-Department of Radiology, Sir Salimullah Medical College & Mitford Hospital, Dhaka. She attended as a Student of FCPS in Radiology and Imaging in BSMMU. She has dedicated her training in the field of Radiology and Imaging. She is a member of Bangladesh Radiology and Imaging Society as well. Prior joining us she had been working successfully as Radiologist at the department of Radiology & Imaging in Shaheed Suhrawardi Hospital. Dr. Shagufta joins Square Hospital?s Radiology & Imaging department as an Associate Consultant.",
        "image": null
    },
    {
        "id": 15,
        "name": "Dr. Shoheli Sultana",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Shoheli Sultana completed her graduation from Sher-E Bangla Medical College in 1995. She dedicated her training in the field of Radiology and Imaging and accomplished MD in Radiology and Imaging from Bangabandhu Sheikh Mujib Medical University in 2010. She had special training on MRI and Breast Imaging from India. She started her career from Faridpur Medical College Hospital as a lecturer, Pharmacology in 2000. She then worked as an IMO-Department of Radiology, Dhaka Medical College Hospital. She is a life member of Bangladesh Society of Radiology and Imaging. She has special interest on Women?s Imaging. Dr. Shoheli joins Square Hospital?s Radiology & Imaging centre in 2010 and working till now as an Associate Consultant. Dr Shoheli has participated in a number of national and international workshop and seminar on Radiology and Imaging. She is a life member of Breast Imaging Society of India.",
        "image": null
    },
    {
        "id": 16,
        "name": "Prof. Dr. Shah Alam",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Shah Alam completed his graduation from Mymensingh Medical College under Dhaka University in 1979. After completing his internship he dedicated his training in the field of Ophthalmology. He passed his fellowship (FCPS) in Ophthalmology from the Bangladesh College of Physicians and Surgeons (BCPS) in 1991. He also received trainings on Ophthalmology from National Institute of Ophthalmology, Dhaka and IPGMR (now BSMMU). He successfully obtained WHO Fellowship in Ophthalmology from Arabind Eye Institute, Madurai, India in 2001. Prof. Dr. Shah Alam started his career as Assistant Registrar in National Institute of Ophthalmology and IPGMR. Due to his well acknowledgement, he shortly got promoted to Resident Surgeon, Jr. Consultant and then to Assistant Professor (IPGMR) in 1996. In 1999, he became Associate Professor and in 2004 became Professor of Ophthalmology in Mymensingh Medical College. He took early retirement from government services in December, 2006 and joined as Consultant in Square Hospital. He has more than 25 years of experience in the field of Ophthalmology.",
        "image": null
    },
    {
        "id": 17,
        "name": "Lt. Col. Dr. Md. Sajedur Rahman",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Lt. Col. Dr. Md. Sajedur Rahman is a medical graduate from Mymensingh Medical College. He completed D.O. from Dhaka University and MD from Hamburg University, Germany. He obtained Fellowship in the field of Ophthalmology (Retina & Laser Surgery) from University of Eye Clinic, Hamburg, Germany. He also acquired advanced training in Phaco and Retinal Laser from Germany. Lt. Col. Dr. Md. Sajedur Rahman worked in department of Ophthalmology at CMH as Eye Specialist and Retinal Surgeon for 15 years earned necessary expertise in managing general ophthalmic diseases and performing eye surgeries. He is a member of Editorial Board, Ocular Infection and Hygiene, Germany and also member of American Society of Ophthalmology and Ophthalmology Society of Bangladesh (OSB).",
        "image": null
    },
    {
        "id": 18,
        "name": "Dr. Md. Mamunur Rashid",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mamunur Rashid is a medical graduate from Rajshahi Medical College. He obtained Fellowship on Internal Medicine (FCPS) from Bangladesh College of Physicians and Surgeons (BCPS). Dr. Mamun completed Doctor of Medicine (MD) in Respiratory Medicine from Bangabandhu Sheikh Mujib Medical University (BSMMU). His field of interest is Interventional Bronchoscope and Critical Care in Respiratory Medicine. Dr. Mamunur Rashid worked as Assistant Professor in Respiratory Medicine in National Institute of Diseases of Chest and Hospital (NIDCH). He was enrolled in medicine in-patient department and respiratory intensive care unit of NIDCH and was engaged in the management of in-patients and critically ill respiratory patients. Dr. Mamunur also worked in Chittagong Medical College. He performed fibre-optic Bronchoscopy as well as Pleuroscopy for diagnostic, therapeutic and treating purposes. Dr. Mamunur Rashid received ?Young Investigator Award? from Asian Pacific Society of Respiralogy (APSR) from Yokohama, Japan. He joined workshop on Fibre-Optic Bronchoscopy (FOB) organized by Indian Association of Bronchology in Agra, India.",
        "image": null
    },
    {
        "id": 19,
        "name": "Dr. Syeda Ishrat Jahan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Syeda Ishrat Jahan completed her graduation from Sylhet MAG Osmani Medical College. After completing her internship she received practical training in different globally acclaimed centers abroad mainly in UK & Singapore in her respective field. She obtained Diploma in Dermatology from National University Hospital, Singapore and worked in National Skin Centre, Singapore. She achieved her Post-graduate (MSc.) degree in Clinical Dermatology from the St. John?s Institute under King?s College, University of London, UK and also worked at Queen Elizabeth Hospital London & King?s Hospital, London. Dr. Ishrat Jahan completed trainings in Dermato-Surgery, Laser and Cutaneous Cosmetic Surgery, Cryosurgery, Chemical Peeling and Phototherapy, dark ground microscopy and pediatric dermatology",
        "image": null
    },
    {
        "id": 20,
        "name": "Prof. Dr. Md. Kabirul Islam",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Md. Kabirul Islam is a senior Pediatric surgeon of the country with experience of more than 30 years in the field. He is the first qualified Pediatric Surgeon in Bangladesh having MS. in Pediatric Surgery degree. Subsequently, he obtained Fellowship from ?International College of Surgeons? (FICS), USA in Pediatric Surgery and also FRCS from Royal College of Physicians and Surgeons, Glasgow ,UK.  Graduating from Chittagong Medical College, Prof. Islam worked in Dhaka Shishu hospital at the beginning of his career. He was the Head of Pediatric Surgery in Dhaka Medical College and Sylhet MAG Osmani Medical College from 1995 to 2007. He attained advanced training on Pediatric Urology from prestigious ?The Great Ormond Street Hospital for Sick Children? in London, UK and also on Pediatric Laparoscopic Surgery from Bangalore, India.  Prof. Islam has more than 45 publications in international and national medical journals and books. He was the Editor-in-Chief of ?The Journal of Surgical Science? the official publication of ?The Society of Surgeons of Bangladesh?. He attended a number of national and international workshops, seminars, and symposiums to enrich his decision making capacity, operative skills and care giving attitude.  Prof. Islam is the winner of the prestigious ?Asir Memorial Gold Medal? from the Society of Surgeons of Bangladesh in 2011 for his work on Oesophageal Atresia correction in Square Hospital. He has special interest in Neonatal, Laparoscopic and Hypospadias Surgery.",
        "image": null
    },
    {
        "id": 21,
        "name": "Dr. M. H. Shaheel Mahmood",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. M.H. Shaheel Mahmood graduated from the Institute of Post Graduate Medicine and Research (IPGM&R) under the University of Dhaka in 1987 and started his career in ENT at same institution. Soon after he joined government services under the Ministry of Health and Welfare, Bangladesh in 1989. ?He was also appointed as an Assistant Registrar, ENT in IPGM&R (BSMMU) in 1991. In 1994 he obtained FCPS from Bangladesh College of Physicians & Surgeons, Dhaka. Dr. Shaheel Mahmood served as Registrar & Resident Surgeon in Dhaka Medical College & Hospital. Then he obtained another professional degree Master of Surgery (MS) and joined the department of ENT in Chittagong Medical College as an Assistant Professor. In 2002 he was designated as an Associate Surgeon, ENT in Shaheed Suhrawardi Hospital. Later he joined as an Associate Professor of ENT and Head in Rajshahi Medical College & Hospital. During his professional life he was involved in teaching of medical students in different levels and performed numbers of ENT Surgeries. He was trained in MEEI (Massachusetts Eye & Ear infirmary) Harvard, Boston USA. House Ear Institute, St Vincent Hospitals Los Angeles, USA. ?He holds more than 20 years of experience in the spectrum of ENT, Head and Neck Surgery.",
        "image": null
    },
    {
        "id": 22,
        "name": "Dr. Md. Nasimul Jamal",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Jamal graduated from Chittagong Medical College. Then he started his career in Specialized ENT Hospital of SAHIC and completed training in the field of otolaryngology (ENT, Head and Neck Surgery). He obtained DLO and FCPS (ENT) from Bangladesh College of Physicians and Surgeon (BCPS). Dr. Jamil moved to UK and from Bradford Royal Infirmary, UK, he acquired advanced training in ear microsurgery and deaf & dumb, vertigo and tinnitus management. ?Dr. Jamil accomplished training in Head & Neck Surgery from Queen Elizabeth Hospital, Birmingham. He is also trained in Endoscopic Sinus Surgery from India.",
        "image": null
    },
    {
        "id": 23,
        "name": "Dr. Sanjoy Banerjee",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Sanjoy Banerjee graduated from Jahurul Islam Medical College in 1999. After graduation he started his career as Medical Officer in ENT department in the same institute. He then trained in the field of ENT and obtained FCPS (ENT) from Bangladesh College of Physicians and Surgeons (BCPS) in 2011. In his carrier he served in different Medical Colleges & Hospitals across the country for last several years and held some vital positions. He has visited different tertiary care level hospitals of home and completed Clinical Observership training in the field of Surgical Oncology from National Cancer Centre Singapore. He is working Square Hospital as Consultant- ENT, Head and Neck Surgery.",
        "image": null
    },
    {
        "id": 24,
        "name": "Dr. Mesbah Uddin Ahmed",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mesbah Uddin Ahmed completed his graduation (MBBS) from Dhaka Medical College. He obtained Diploma in orthopedics in 1986 and Master of Surgery (MS) in Orthopedics from NITOR under Dhaka University in 1994. Dr. Mesbah Uddin Ahmed joined in government services under Health Ministry and started his career in Dhaka Medical College and later worked in different institutions including Mymensingh Medical College and Sylhet MAG Osmani Medical College. He worked in district hospitals of Rangamati, Narayanganj, Netrokona and Tangail. He has teaching experience as Associate Professor, Assistant Professor, Senior and Junior Consultants, Registrars and Assistant Registrars. He is experienced in Orthopedics for more than 32 years. Dr. Mesbah is A.O. Fellow in AO Basics and advanced courses. He has large number of publications and has attended different national and international conferences, seminars and workshops including arthoplasty, arthroscopy and hand & spine surgery.",
        "image": null
    },
    {
        "id": 25,
        "name": "Dr. Fazlul Hoque",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Fazlul Hoque graduated (MBBS) in 1981 from Rajshahi Medical College and the joined in government services in Bangladesh. ?He received his Diploma in Orthopedic surgery in 1990 from the University of Vienna Austria and achieved specialization in orthopedics surgery (Facharzt). He completed Fellowship of Austrian Medical Association (FAMA and worked as a research Fellow in Spine at A. I. DuPont Institute at Wilmington, Delaware, USA. Later Dr. Fazlul Hoque joined in Centre for the Rehabilitation of Paralyzed (CRP), Savar, Dhaka. He worked at CRP about 13 years as a Consultant, Orthopedics & Spine Surgery which was followed to as Medical Director. He holds wide range of experiences for the management of deformity of the foot like TEV and has international publication on surgical management of club foot. He is proficient in performing anterior decompression and stabilization of the spinal column, spinal injury and advance spinal tuberculosis, correction of the spinal deformity and spondylolisthesis. With his long experience in Spine he becomes an international faculty in Spinal Cord injury (SCI) and at present he is the Vice President of International Spinal Cord Society (ISCoS). He is the founder chairman and executive member of Asian Spinal Cord Society Network (ASCoN). As a Chairman or Presenter of Scientific Paper he attended more than thirty international scientific conferences. He has a good number of publications on Orthopedics, Spinal injury and Telemedicine. Dr. Hoque received an international award ?Lar Gullivan Award? for best presentation adhering to the idea of comprehensive system care of spinal cord injuries.",
        "image": null
    },
    {
        "id": 26,
        "name": "Dr. A M Rejaus Satter",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. A M Rejaus Satter is a physician specializing in Neuro Surgery. At Square Hospital, he has been an active team member who has helped to develop a center excelling at endoscopic pituitary surgery, aneurysm surgery, complex brain tumor surgery, minimally invasive spine surgery and other intricate brain surgeries; in the private sector of Bangladesh within a very short period of time. ? Completing his MBBS from Mymensingh Medical College, Dr. Reja entered into Post graduation and earned FCPS in General Surgery. Shortly after, he pursued his lifelong dream of becoming a Neuro Surgeon when he entered MS (Neuro surgery) course and obtained Masters Degree. He was trained and supervised by the best Neuro Scientists and Neuro Surgeons of both Bangladesh and India. Today, as Consultant Neuro and Spine surgeon of Square Hospital, he performed thousands of complex Neuro surgery in past years with lowest complication rates compared to the rest of the country and also some other countries.? Dr. Reja has been exposed to all ranges of emergencies starting from trauma to intracerebral hematomas and strokes; entire ranges of emergency spinal decompression, brain tumors, spinal tumors, ?trans-sphenoidal surgery, congenital and pediatric neurosurgical disorders; degenerative spine diseases; endoscopic neurosurgical procedures; vascular disorders like aneurysms and AVMs.",
        "image": null
    },
    {
        "id": 27,
        "name": "Prof. Syed Md. Akram Hussain",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Syed Md Akram Hussain, MBBS, FCPS, FRCP, FACP is a physician of Oncology is working in Square Hospitals Ltd. with his prominent reputation in education, skill and adequate experiences in working in various capacities of hospitals at home and abroad. He has 25 years of practical experience and expertise in the field of Clinical Oncology. Prof. Akram has a very rich track record of working in different organizations in his career. Previously he performed as Chief Consultant, Clinical Oncologist in Lab Aid Specialized Hospital, Dhaka. He was Senior Consultant of Ahsania Mission Cancer Hospital. He was the Founder, Professor and Chief Oncologist of NorthEast Cancer Hospital, Sylhet. Prof. Akram is also known for as he was the Founder Chairman of Oncology Department of BSMMU. Throughout his challenging career he has earned professional degrees which are MBBS; FCPS; WHO Fellowship from National Cancer Institute - Bangkok; KOICA Fellowship, National Cancer Institute - South Korea; WHO Fellowship on Medical & Radiation Oncology, Tata Memorial Hospital - India; FRCP (Glasgow); FRCP (Edinburgh); FACP (USA); MRCR (UK). He has obtained numerous clinical trainings on Medical and Radiation Oncology from different world class institutions such as Tata Memorial Hospital (India), German Cancer Research Institute (Germany), National Cancer Centre (Singapore), Harvard University (USA).",
        "image": null
    },
    {
        "id": 28,
        "name": "Dr. Md. Salim Reza",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Md. Salim Reza obtained MBBS from Sylhet Medical College and Diploma in Medical Radiotherapy (DMRT) from University of Dhaka and FCPS degree from Bangladesh College of Physicians and Surgeons (BCPS). Dr. Reza worked in different capacities like Registrar, senior Registrar, Junior Consultant and Consultant for last several years. Before joining Square Hospital as Consultant ?Oncology, he was a Consultant of Oncology in Ahsania Mission Cancer Hospital, Dhaka.",
        "image": null
    },
    {
        "id": 29,
        "name": "Dr. Md. Masudur Rahman",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Md. Masudur Rahman graduated from Dhaka Medical College and obtained FCPS in pediatrics from Bangladesh College of Physicians and Surgeons (BCPS). He was awarded MRCP in pediatrics from the Royal College of Physicians, UK. Dr. Masud had the opportunity to work in different capacities in a number of renowned hospitals in Bangladesh, United Kingdom and Saudi Arabia which enabled him to acquire vast experience in his field. He served different government hospitals under Ministry of Health and Family Welfare in Bangladesh. He performed in Royal Hospital for Sick in Glasgow, Scotland. He went to Saudi Arabia and worked in 150 beds regional pediatric Taif Children Hospital. He enriched his knowledge and skills by unique blending of experience and wisdom by working in both developing and developed countries. He received several higher training in neonatal resuscitation, breast-feeding, diarrheal diseases, upper GI Endoscopies & liver biopsy in children, research methodology and communication etc. Dr. Masud has more than 20 years of experience in pediatrics patient care.",
        "image": null
    },
    {
        "id": 30,
        "name": "Dr. Major (Retd) Zeena Salwa",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Major (Retd) Zeena Salwa has completed her medical degree (MBBS) from Rangpur Medical College under Rajshahi University. She has post-graduation on Diploma in Child Heath (DCH) From Bangabandhu Sheikh Mujib Medical University (BSMMU) and also completed her highest degree FCPS (Pediatrics) from Bangladesh College of Physicians and Surgeons (BCPS). She started her carrier as Medical Officer in Bangladesh Army after internship training and served in Army Medical Corps (AMC) for 16 years in different cantonments as practicing physician with different leadership positions. She managed department of Pediatrics independently after her post-graduation degree in AMC and has extensive experiences in clinical patient management, counseling and prevention approaches. Dr. Zeena has expanded her career with Square Hospital Ltd (SHL) since 2010 as Pediatrician and expanded vision toward Pediatric Neurology for new services in SHL for responding the emerging needs of children in Bangladesh. She further received intensive clinical training in Pediatric Neurology from Dhaka Shishu Hospital and Christian Medical College (CMC), Vellore, India. Recently she has received training on Epilepsy and EEG from Cleveland Clinic, USA. Being a Consultant, she is performing individual and independent patient treatment and management both in critical and chronic illness of Pediatric patients including Pediatric Neurology. She has provided leadership for orchestrating a new service with establishment of Square Child Development Center (CDC) for addressing neurological disorders of children in 2017. She also introduced a new service for screening of ?Newborn??through Square (CDC). She has participated in many national and International conferences, presented and published papers. Her continued interest is in Pediatric Neurology including Developmental Pediatrics along with general Pediatrics. She is a member of national and international Pediatric associations and Pediatric Neurology associations as well.",
        "image": null
    },
    {
        "id": 31,
        "name": "Prof. Dr. ABM Abdus Salam",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. ABM Abdus Salam obtained MBBS from Sir Salimullah Medical College & Mitford Hospital in 1983. After finishing his internship, he was appointed as GP in sub-divisional hospital in Islamic Republic of Iran in 1984 to 1991. Then he was appointed as senior Medical Officer & Register in Dhaka Shishu Hospital (DSH) from 1992-2001. He obtained FCPS (Pediatrics) in January 1995 from Bangladesh College of Physicians (BCPS). During this time he obtained one year training in pediatric Cardiology from DSH. He also obtained MD (Pediatrics) in January 1998 from Dhaka University.? In 2001 Prof. Abdus Salam joined as an Assistant Professor of Pediatric Cardiology in National Institute of Cardiovascular Disease (NICVD) & promoted to Associate Professor in 2003. Finally, he was promoted as the Professor of Pediatric Cardiology in 2016. During this time he obtained his post graduation fellowship training in Interventional Pediatric Cardiology AIMS, India and also from Australia & Germany. He has firstly organized the pediatric cardiology services in NICVD ?a tertiary care cardiovascular of Bangladesh acting as the Head of the Department. Prof. Dr. Abdus Salam joined in Square Hospital Limited as Consultant of Pediatric Cardiology since 2009. ?? He is an internationally reputed interventional pediatric cardiologist, achieved the skill of all kinds of pediatric cardiac intervention including device closure of ASD, VSD.PDA, RSOV, A-P Window and all kinds of valvuloplasty/angioplasty for PS, AS, CoA & also PDA stenting & septostomy. He performed more than 500 PDA devices, 100 ASD devices, 55 VSD device closure, and 150 valvuloplasty/angioplasty individually. He attained many national & international seminar, symposium & conferences as the faculty & presented more than 25 oral/poster presentations. He has 25 research publications in different national & international medical journals. He is affiliated as the examiner of FCPS, MCPS & MD examinations with BCPS & BSMMU. Prof. Abdus Salam is the Vice President of Pediatric Cardiac Society of Bangladesh (PCSB) & also the General Secretary of Bangladesh of Child Heart Trust of Bangladesh (CHTB) which is a benevolent organization.?",
        "image": null
    },
    {
        "id": 32,
        "name": "Dr. Aftab Yusuf Raj",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Aftab Yousuf Raj MBBS, MD (Pediatrics), MD (Neonatology), Fellow-(Neonatology) AIIMS, India, Fellow (Neonatology & Pediatrics)-Canada, graduated from Sher-E-Bangla Medical College. He then trained in the field of Pediatrics and Neonatology and served in different Medical Colleges & Hospitals across the country and held some vital positions including Associate Professor of Pediatrics and Neonatology for several years. He received training in his respective field from all India Institutions of Medical Science and Calgery Medical University (New Born Health) and Alberta Children Hospital (Child Health) Canada. He also worked as a Consultant at United Hospital, Dhaka.",
        "image": null
    },
    {
        "id": 33,
        "name": "Prof. Sk. Md. Bahar Hussain",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Sk Md. Bahar Hussain obtains MBBS in the year of 1979. After graduation he served in several reputed Hospital all across the country. Prof. Sk Md. Bahar Hussain obtained his FCPS (Medicine) in 1988, F.Gastro from Shanghai in 1991. Afterwards, he was awarded FRCP (Edin), FRCP (Glasg), FACP (USA). Prof. Hussain served as Adviser specialist in Medicine & Sr. Gastroenterologist at CMH- Dhaka & Chittagong for 20 years. He is an expert of all intervention Gastroenterology. Prof. Sk Md. Bahar Hussain has more than 75 publications both in international and national levels.",
        "image": null
    },
    {
        "id": 34,
        "name": "Prof. Dr. Md. Sanawar Hossain",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Md. Sanawar Hossain is a retired professor of surgery, joined the Square Hospitals Ltd. since its inception in May 2005. He organized its preparation for opening the hospital which took place on the 16th of December 2006. He started as a Consultant Surgeon and secured the position of Director Medical Services for more than 10 years in addition. He is a Fellow of General Surgery (FCPS) from Bangladesh College of Physicians & Surgeons and ECFMG qualified from US by examinations. He is trained in different branches of Surgery from 12 different countries including Australia, Thailand, Singapore and UK as WHO fellow. Honorary Fellowship was conferred upon him by College of Physicians & Surgeons of Pakistan and AMASI - India. ? He is a First Generation Laparoscopic Surgeon in both basic and advanced laparoscopic specialty with great interest in Hepatobiliary and Oncologic surgeries of upper and lower GIT. ?He has got an extensive experience in Cancer Breast and Endocrine surgeries & takes interest in complicated, complex, revision and Redo surgeries. He is known as a great teacher & trainer in surgery and has covered almost all medical colleges & corners of this country & accumulated surgical experience for over more than 40 years and continuing the services untiredly even today with the grace of Almighty. ? ?",
        "image": null
    },
    {
        "id": 35,
        "name": "Prof. Dr. Sudhakar Chandran Bose",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Sudhakar Chandran Bose obtained his MBBS from University of Madras, Chennai, India and MS (general surgery) from The Tamilnadu Dr. MGR Medical University, Chennai, India. ?Afterwards he was awarded FIAGES ? Fellow of the Indian Association of Gastrointestinal Endosurgeons on 2015. Prof. Dr. Sudhakar Chandran Bose has 23 years of prolonged specialized experience. He had special training from reputed hospitals of India, UK, and USA on critical general surgery, laparoscopy surgery, colorectal surgery, gastrointestinal surgery, thyroid and breast and has successfully performed various critical surgeries.? In 1997 Dr. Sudhakar joined at the Christian Medical College & Hospital, Vellore, India as Lecturer in Surgery and served there in different capacities for 19 years. He also served as Professor of Surgery at the Christian Medical College & Hospital, Vellore, India for 10 years. ?Later Dr. Sudhakar served at Ministry of Health, Saudi Arabia as Senior Specialist in General Surgery.? He has presented enormous number of concrete and valuable research materials on surgery in several national and international seminar symposiums and has more than 29 publications both in international and national levels.",
        "image": null
    },
    {
        "id": 36,
        "name": "Dr. Mohammad Yasin Chowdhury",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mohammad Yasin Chowdhury graduated ( MBBS ) from Sylhet M.A.G. Osmani Medical College in 1996. He started his carrier in the Department of General Surgery of Chittagong Medical College Hospital. In 2003 he was deputed to BSMMU and successfully obtained FCPS in General Surgery in 2005. Then he posted to NIDCH, Dhaka and completed MS in Thoracic Surgery in 2006. He had wide experience in the field of General , Laparoscopy, Colorectal & Thoracic Surgery. He attained advanced training on Laparoscopy, Colorectal & Minimal Access Surgery in China & India. He obtained Fellowship on Laparoscopy & Minimal Access Surgery ( FMAS ) from AMASI, India in 2016. He is Life Member of SOSB, SLSB, BMA, BCPS. Now he is working as Consultant in the Department of General Surgery at Square Hospitals Ltd. Dhaka.",
        "image": null
    },
    {
        "id": 37,
        "name": "Prof. (Dr.) Ninan Chacko",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. (Dr.) Ninan Chacko, MBBS, MS, MCh (Urol.), FRCS (Urol.) is an Eminent Urologist, and a familiar name in the field of Urology Surgery in India. He was Professor of Urology on the Faculty of Urology at Christian Medical College & Hospital, Vellore India. He has trained many prominent Urologists now practicing all over the world. He is available for regular Consultation and Surgery in Square Hospital, Dhaka. He had his entire training at CMC, Vellore & obtained MBBS & MS [Gen Surg.] from Madras University and MCh [Urol] from MGR Medical University, Madras, India. He had further super-specialty training in Urology at the Freeman Hospital, Newcastle-upon-Tyne, UK and was awarded the FRCS [Urol.] by the Inter-Collegiate Board of the Royal Colleges of Surgeons. He has extensive experience in Renal Transplant & Renovascular Surgery, Endourology, Stone Surgery, Laparoscopic Urology, Paediatric Urology, Reconstructive Urology, & General Urology. He was and is active in Urologic Society of India, Association of Southern Urologists & Tamil Nadu and Pondicherry Association of Urologists, where he has conducted CMEs, Workshops and presented papers. He has published over 60 papers in Peer reviewed International Medical Journals a few Chapters in Textbooks. Prior to joining us, he worked as a Professor Urology in CMC, Vellore, where he earned a great reputation in Urology care.",
        "image": null
    },
    {
        "id": 38,
        "name": "Dr. N. I. Bhuiyan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. N I Bhuiyan Bhuiyan graduated from Sir Salimullah Medical College and started his career as Lecturer at Dinajpur Medical College. He worked in Dhaka Medical College Hospital in Surgery Department and later in Casualty Surgery Department. Subsequently, he enrolled as thesis student in the department of Urology in the same institute and obtained his MS (Urology). Dr. N I Bhuiyan joined Bangladesh Medical College as Assistant Professor, Urology. He visited USA, Germany, Singapore, India and Thailand for extensive advanced training in Urology. He attained advanced course on Laparoscopic Urology from IRCARD, Taiwan. ?He got advanced training on use of LASER in Urology from Germany. Dr. N I Bhuiyan was awarded Major Gen. K M Siraj Jinnat Memorial Gold Medal for innovative work on urology by Bangladesh Association of Urological Surgeons (BAUS). He presented many scientific papers in different interaction conferences in home and abroad. He has publications in national and international level. Dr. Bhuiyan is the author of one chapter of Urology book (Principal and Practice of Urology, Second Edition, Editor M A Salam.",
        "image": null
    },
    {
        "id": 39,
        "name": "Prof. Dr. Md. Abu Bakar",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Md. Abu Bakar passed MBBS from Sher-e-Bangla Medical College and completed FCPS degree in Internal Medicine from Bangladesh College of Physicians and Surgeons (BCPS). Dr. Md. Abu Bakar performed as Consultant, Medicine in Faridpur General Hospital. ?Later, he joined in Khulna Medical College as an Assistant Professor of Internal Medicine and worked there in different capacities for 19 years. He served as Professor and Head of the Department of Medicine and was also the Vice Principal & Principal of Khulna Medical College. Prof. Abu Bakar received fellowship FACP from American College of Physicians, USA. He also obtained FRCP from Royal College of Physicians of Edinburgh, UK. ? He encompasses more than 35 years of experience in medicine field. He has 41 scientific publications in national & international journals.",
        "image": null
    },
    {
        "id": 40,
        "name": "Dr. Jahangir Alam",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Jahangir Alam graduated from Dhaka Medical College under the University of Dhaka in January, 1986. Like most other Bangladeshi medical professionals, he completed his internship from the following Institute. He started his career as Medical Officer under Ministry of Health, Bangladesh. Later he traveled to KSA and joined as Medical Resident at Medicine Department in Buraidah Central Hospital Al Gassim in 1988. Meanwhile, he obtained MRCP from the Royal College of Physicians, UK in 2002 and worked there as a Medical Specialist from 2002 -2004. The following year he left the hospital and subsequently joined as a Consultant, Internal Medicine in King Fahad Specialist Hospital, Buraidah Al Gassim, KSA. In 2006, Dr. Jahangir Alam returned to motherland and joined as Consultant, Internal Medicine in Diabetic Association of Bangladesh. Afterward, he performed as Associate Consultant, Internal Medicine in United Hospital, Dhaka. He joined Square Hospital in January 2008. During his professional services, he achieved advanced training in Endocrinology and Diabetology, Hematology and Neurology, Emergency and ICU, Blood Disorders and Infectious Diseases management. He had been involved in teaching medical students of Gassim Medical College, and Residency Program of Saudi Council for health specialist at King Fahad Hospital and candidates appearing in MRCP. Dr. Jahangir Alam was awarded with FRCP (Edin) from the Royal College of Physicians, Edinburgh, UK in March, 2017. He attended international scientific seminars and presented scientific papers. He works Square Hospital as Consultant, Internal Medicine - Diabetes and Endocrinology.",
        "image": null
    },
    {
        "id": 41,
        "name": "Dr. Md. Towhiduzzaman",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Education: Dr. Towhiduzzaman graduated with MBBS degree in January 1994 from Sher-e-Bangla Medical College, Barisal and Doctor of Medicine (MD) in Cardiology degree ? in January 2002 from National Institute of Cardiovascular diseases (NICVD) under university of Dhaka. Training & Fellowship: After obtaining his post graduate degree he started his professional career as Consultant Cardiologist at NICVD and also worked Z H Sikder Women?s Medical College, Gulshan till 2005. ? Dr. Towhiduzzaman received SAARC Cardiology ?hands on Fellowship in Interventional Cardiology at Escorts Heart Institute and Research Centre (EHIR&C), New Delhi, India for 01(one) year in June 2006. Subsequently he was selected for another 01 year hands on Fellowship program in Interventional Cardiology at National Heart Centre, Singapore and received the fellowship award in July 2007. ?He has successfully completed Rotablation, Intravascular ultrasound Pressure wire and peripheral stenting course. He also gained and experienced a numerous number of invasive and clinical training and observatory fellowship and visited ?USA, Canada, France, England, Japan, Italy, Sweden, Hong Kong, China, Jamaica, Costarica, Vietnam, Malaysia, Thailand, India, Pakistan and Nepal.? Dr. Towhiduzzaman has published articles and presented cases at numerous national and international conferences. He has vast experiences of 10 years to perform invasive & interventional and complex diagnostic and therapeutic procedures independently & confidently. He is regular Faculty/Guest Speaker and participated in a large number of International workshops, seminars, symposiums both home and abroad that has enriched his decision making capacity, professional skills and care giving attitude to an international level. For last 10 years he is performing highest number of complex bifurcation, CTOs, primary PCI, and Renal & Peripheral Angioplasties at Square Hospital. His sub specialty interest is in Interventional Cardiology. Professional Appointment & Committee Membership: Life Member ? Bangladesh Cardiac Society (BSC), Bangladesh Society of Cardiovascular Interventions (BSCI), Bangladesh Society of Echo Cardiography (BSE), Bangladesh Medical Association (BMA) Org. Secretary (Elect) Bangladesh Cardiac Society from 2015, Scientific Secretary (Elect), 2009 ? 14. Others: Fellow, Society of Cardiac angiography &Intervention(FSCAI, USA), Associate Fellow American College of Cardiology (FACC), Member-American Society of Echocardiography (MASE), European Society of Percutaneous Cardiovascular Interventions. (EPACI), European Society of Cardiology (MESC)",
        "image": null
    },
    {
        "id": 42,
        "name": "Dr. Sheikh Nafis - ur Rahman",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Sheikh Nafis-ur Rahman completed his graduation from Sir Salimullah Medical College and Mitford Hospital in 2001, and then he completed MD in Radiology & Imaging from Dhaka Medical College & Hospital in 2009. During his training he worked in Dhaka Medical College & Bangabandhu Sheikh Mujib Medical University, Radiology & Imaging Department. He had special training on advance uses of 3T MRI from Breach Candy Hospital, Mumbai, India. He started his career as Radiologist in Monno General Hospital. Later, as Assistant Professor of Radiology & Imaging Dr. Nafis joined Khwaja Yunus Ali Medical College & Hospital where he got extensive exposure to Oncological Imaging and did various Interventional procedures. Dr. Nafis has many publications in different reputed journal. He is a life member of Bangladesh Society of Radiology and Imaging. Dr. Nafis joined Square Hospital?s Radiology & Imaging centre in 2012 and working till now as an Associate Consultant.",
        "image": null
    },
    {
        "id": 43,
        "name": "Professor Dr. Sufia Nasrin Rita",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Professor Dr. Sufia Nasrin Rita passed Bachelor of Dental Surgery (BDS) from Dental Unit of Chittagong Medical College under Chittagong University in 2000. After training and research, she passed FCPS in Orthodontics & Dentofacial Orthopedics FIRST TIME in Bangladesh from Bangladesh College of Physicians and Surgeons (BCPS) in 2007. She gained different medical and dental skills by doing extensive training on different subjects of dentistry.? Professor Rita is related to many clinical and academic activities by delivering lectures, developing course curriculum for students and dental doctors and she is the question setter, moderator and examiner of BDS, MCPS, FCPS examinations. She presented on dentistry and orthodontics in several scientific conferences and published 25 scientific articles in recognized reputed journals. She used to deliver awareness speech and treatment advices regularly in Televisions and social medias. Professor Dr. Sufia Nasrin Rita had been serving patients with treating general diseases of oral cavity, teeth and gum by scaling, polishing, filling, Root Canal Treatment, removal of teeth, replacement of missing teeth for the last 21 years in different clinics and hospitals of Bangladesh. Her special interest is mostly on improving facial appearances and beauty with correction of spacing, irregularity, mal alignment and malposition of teeth and jaws by BRACES and ORTHODONTIC treatment.? Prof Rita is the editorial board member of BCPS Journal and also the member of Faculty of Dentistry, IT, Medical Education?Department of Bangladesh College of Physicians and Surgeons (BCPS). At present she is working as Professor and Head of Dept of Orthodontics in Sapporo Dental College in the morning and as Consultant of Dental Surgery and Orthodontics at Square Hospitals Ltd in the evening.",
        "image": null
    },
    {
        "id": 44,
        "name": "Associate Professor Dr. S. M. Anwar Sadat",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. S. M. Anwar Sadat passed Bachelor of Dental Surgery (BDS) from Dental Unit of Chittagong Medical College under Chittagong University in 1997. He passed MCPS in Dental Surgery from BCPS in 2003; FCPS in Oral & Maxillofacial Surgery FIRST TIME in Bangladesh from BCPS in 2005. He also did his masters (MS) in same discipline from Dhaka Dental College under Dhaka University in 2009.?  Recently in 2021, Dr. Anwar Sadat has been awarded FDSRCPS from Glasgow, United Kingdom for his excellent academic, research and clinical contribution to the dentistry of Bangladesh.  He got advanced training in oral cancer surgery and reconstruction from University of Peradeniya, Kandy, Sri Lanka as JICA Fellowship (Japan); Dental Implant from Boston, USA; Aesthetic Jaw Surgery from Chulalongkorn University, Thailand; Cancer and Trauma Reconstruction from Peking University, China.  He had been serving patients of Dentistry and Maxillofacial Surgery for the last 23 years in different Government and non-government hospitals of Bangladesh. Along with the general dental treatment like Extraction of teeth, scaling, polishing, filling, root canal treatment, crown bridge prosthesis, he has special interest on treating oral cancer, oral ulcer, facial trauma and missing tooth by placement of DENTAL IMPLANT.  ?He is related to extensive academic activity with delivering lectures, conducting clinical sessions for doctors, research activity on oral ulcer and oral cancer and health related talk in Televisions and social medias. With his credit, he presented more than 100 presentations in conferences and workshops and also published 59 scientific articles in reputed national and international scientific journals. Dr. Sadat is Member Secretary, Faculty of Dentistry, BCPS. He is editorial board member of BCPS Journal, advisor of Update Dental College Journal, member of IT, CPD, RTMD, Question Bank, Curriculum development, Skill development and Medical Education Department of Bangladesh College of Physicians and Surgeons (BCPS). He used to conduct ICT Training in BCPS and Research Methodology Training in BCPS and other organizations. He has contribution to curriculum development of courses of dental specialities and he is the question setter, moderator and examiner of MCPS in Dental Surgery and FCPS in oral and Maxillofacial Surgery.  At present he is working in the department of Oral and Maxillofacial Surgery, Dhaka Dental College in the morning and as Consultant at Square Hospitals Ltd, Dhaka in the evening.",
        "image": null
    },
    {
        "id": 45,
        "name": "Prof. Dr. S. R. Begum",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Sultana Razia Begum graduated from Mymenshingh Medical College and secured 2nd position with Honors in Surgery and Obstetrics and Gynecology. ?In FCPS examination she passed it in the 1st attempt from Bangladesh College of Physicians and Surgeons (BCPS). Prof. S. R. Begum started practicing at the department of ObsGyn in Dhaka Medical College. Afterwards she joined Rajshahi Medical College as Assistant Professor and eventually promoted to the rank of Associate Professor and Professor of ObGyn. She chaired ObsGyn department of Rajshahi Medical College, Sher-e- Bangla Medical College and Bangabandhu Sheikh Mujib Medical University (BSMMU). As a Professor of ObsGyn, she engaged in teaching under Graduate, Post Graduate, Masters and Fellowship level. She is the examiner of all the universities of the country, College of Physicians and Surgeons. Prof. S R Begum conducts research by herself and supervises research works of FCPS and MS students. She attended innumerable workshops and conferences in different countries of Europe, USA and Asia. With over 30 years of experience Prof. S. R. Begum is one of the highly skilled Consultant of Square Hospital.",
        "image": null
    },
    {
        "id": 46,
        "name": "Dr. Nargis Fatema",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Nargis Fatema graduated from Sir Salimullah Medical College. After completing internship she dedicated her at the department of Obstetrics & Gynaecology of BIRDEM. Later, she accomplished the fellowship FCPS in Obstetrics & Gynaecology from Bangladesh College of Physicians and Surgeons (BCPS) in 2000 and later obtained MS (ObsGyn) from BSMMU. Dr. Nargis Fatema joined in government services under Ministry of Health and Family Welfare and worked in Dhaka Medical College Hospital, Sir Salimullah Medical College & Mitford Hospital. She received advanced training in Laparoscopic Surgery from BIRDEM and performed as a faculty member of MOET training course. She participated and presented papers in a number of national and international workshops, seminars, and symposiums and was awarded for her research paper in SAFOG conference and EASD conference at Italy. Her approach towards the patients is very holistic which includes not just understanding the disease but also the feelings and emotional state of the patient and her family. Her 24 years of experience is enriched with knowledge, decision making capacity, operative skills and care giving attitude. She has special interest in high risk pregnancy and laparoscopic surgery. She is working as a full time consultant at Square Hospital from 2007.",
        "image": null
    },
    {
        "id": 47,
        "name": "Dr. Khaleda Yeasmin Mirza",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Khaleda Yeasmin Mirza Obtained MBBS from Chittagong Medical College in 1987, DGO from Royal College of Physician, Ireland in 1997 & Arab Board in Obst/Gynae (KSA) in 2001.She started her career in Chittagong Medical College & then moved to Saudi Arabia. She worked in Medina Maternity & Children Hospital, KSA & King Faisal Military Hospital till 2006 then joined in Square Hospital & Working as Consultant till now. ? She attended Fellowship program on minimal invasive surgery in World Laparoscopy Hospital, New Delhi & awarded fellowship (FMAS). She also achieved hands on training on suture less vaginal Hysterectomy from Purohit General Hospital, Orissa, India & Total Laparoscopic Hysterectomy from Sunrise Hospital, Delhi, India. She achieved advanced training in Laparoscopic Hysterectomy & Myomectomy from K. K. Women?s & Children Hospital, Singapore. She has more than 25 years experience in the field of Obstetrics & Gynecology.",
        "image": null
    },
    {
        "id": 48,
        "name": "Dr. Kashefa Nazneen",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Kashefa Nazneen graduated from Rajshahi Medical and obtained FCPS (Gyne & Obs) degree from Bangladesh College of Physicians and Surgeons. After post graduation she joined AD-Din Hospital, Mogbazar, Dhaka. Dr. Kashefa Nazneen worked in government services under Ministry of Health and Family Welfare and provided care and services in different thana Health Complexes. She also involve in Family Planning (MOHFW). She has vast experience to perform invasive & complex procedures including laparoscopic surgery at respective subject independently & confidently. Dr. Kashefa participates in many international workshops, seminars, symposiums both home and abroad that enriches her decision making capacity, professional skills and care giving attitude to a standard level.",
        "image": null
    },
    {
        "id": 49,
        "name": "Dr. Nasima Shaheen",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Nasima Shaheen graduated from Dhaka Medical College. She accomplished the fellowship FCPS in Obstetrics & Gynaecology from Bangladesh College of Physicians and Surgeons (BCPS). She owned MCPS & DGO in ObsGyn from BCPS & Bangabandhu Sheikh Mujib Medical University (BSMMU) respectively. Dr. Nasima Shaheen employed in government services under Ministry of Health & Family Welfare. She also worked in Bangabandhu Sheikh Mujib Medical University (BSMMU) and in Azimpur Maternity (MCHTI) at Dhaka. She gained wide range of experience to practice & perform all types of obstetrical & gynecological management including laparoscopic surgery independently. ?",
        "image": null
    },
    {
        "id": 50,
        "name": "Dr. Kazi Shamsun Nahar",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Kazi Shamsun Nahar graduated from Khulna Medical College. After completing internship she dedicated her training in the field of Obstetrics & Gynecology and successfully obtained FCPS in ObsGyn from Bangladesh College of Physicians and Surgeons (BCPS). During her course she had extensive training on all types of gynecological and obstetric procedures. She gained experience in performing wide spectrum of obsgyn functions throughout her government services under Ministry of Health and Family Welfare. She also worked in National Medical College Hospital and Bangladesh Medical College Hospital. Dr. Shamsun Nahar performs all types of obstetrical and gynecological managements and surgeries successfully.",
        "image": null
    },
    {
        "id": 51,
        "name": "Prof. Dr. Md. Anowar Hossain",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Md. Anowar Hossain graduated from Dhaka Medical College in 1977. He joined in Laboratory Sciences Division of ICDDR,B in 1980 and was trained overseas in diagnostic microbiology and infectious diseases as the fellow of the Dept of Microbiology and Laboratory Medicine, Free University of Brussels, Belgium in 1985-86. ? He was trained in hematopathology from the then IPGMR (BSMMU) in 1990-92 and obtained the Membership (MCPS) in Clinical Pathology from the Bangladesh College of Physicians and Surgeons (BCPS) in 1992. He also obtained the Membership (MCAP) and Fellowship (FCAP) of the College of American Pathologists in 1999 and 2008 respectively. Dr Anowar worked with ICDDR,B for over 35 years in various capacities and lastly held the position of Senior Scientist and Head of Laboratories Operation Management. ?While in ICDDR,B ?Dr Hossain led the operational activities for laboratories and to achieve accreditation for ISO 15189 and 15190 respectively. He was interested in public health, actively involved and conducted research on microbiologic epidemiology, antimicrobial resistance and development of rapid diagnostics for bacteria and viruses. He had around 100 publications in his credit in peer-reviewed international journals and had collaboration with various overseas universities and provided consultation in development of diagnostics to MP Biomedical, Singapore. He was also involved I teaching and training Dept of ICDDR,B and trained the national and international fellows, mentored post graduate students (M Sc, M Phil and PhD) and supervised their thesis. He teaches students of Jahurul Islam Medical College and later in Kumudini Womens Medical College for 15 years as Professor of Microbiology and conducted professional exams as Examiner of Dhaka University.",
        "image": null
    },
    {
        "id": 52,
        "name": "Prof. Dr. Zahidul Hasan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Professor Zahidul Hasan has graduated from Dhaka Medical College. He obtained M. Phil in Microbiology from Bangabandhu Sheikh Mujib Medical University and MPH in Epidemiology from National Institute of Preventive and Social Medicine. In his early career he served in Tea gardens in Sylhet under Duncan brothers and Shaw Wallace Bangladesh respectively. He served as Professor and Head of the Department of Microbiology in Bangladesh Medical College, Dhaka and then served as Professor of Microbiology in Ibrahim Medical College. Finally in 2006 he joined Square Hospital as Consultant- Microbiology. Professor Hasan has vast experience in the field of Clinical Microbiology and Infection Control. He is the founder President of ICPPB (Infection Control and Prevention program, Bangladesh) and is regarded as the spearhead in introducing hospital based infection control activities in Bangladesh. He published numerous scientific papers and attended scientific conferences in home and abroad. In addition, he was the founder Executive Editor of Bangladesh Medical College Journal. He also acted as guide for students of University of Dhaka and Kings College, London University. In addition, Professor Hasan is actively involved in nursing education and various social and cultural activities. He is also voluntarily serving as honorary Vice President of FDSR (Family Development Services and Research), a non-government organization providing healthcare services to remote rural population.",
        "image": null
    },
    {
        "id": 53,
        "name": "Dr. Bidoura Naznin",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Bidoura Naznin graduated from Mymensingh Medical College. She obtained her professional degree MD (Pathology) under University of Dhaka and MCPS (Clinical pathology) from Bangladesh College of Physicians & Surgeons (BCPS). She worked as Associate Professor and Head in Dhaka Community Medical College & as Assistant Professor in East West Medical College, Dhaka. ?She also worked in Holy Family Red Crescent Medical College Hospital as SMO. She gained advanced experience from Osaka University Hospital, Japan & also from India. She has national & international Publications in related field.",
        "image": null
    },
    {
        "id": 54,
        "name": "Dr. Nurunnahar Mawla",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Nurunnahar Mawla obtains MBBS from Chittagong Medical College in 1997 and completed her Internship in the same institution. She has got her M Phil in Microbiology from Sir Salimullah Medical College in 2007. Earlier she worked as Medical officer in different clinics of Dhaka and as a lecturer in State college of Health Science as well. After achieving the post graduation she served ICDDR,B ?as Senior Scientific officer till 2010, then went to Vietnam where worked as Biologist in a French-Vietnam (FV) Hospital laboratory for one year. She then joined in Delta Medical College as Assistant Professor after coming back from Vietnam, worked for 4 years & promoted as Associate Professor there. At the same time she practiced her laboratory expertise in Eden Multi-care Hospital?s Laboratory. She participated some national and international conferences and presented Scientific papers. She has 3 original & 1 review articles published as First author, also many abstracts & articles as co-author. She has training on ?Welcome Trust Advanced course Genomics and Clinical Microbiology? in 2011 in UK, also on ISO 15189. Dr. Nurunnahar joined Square Hospital as Associate Consultant of Microbiology and Infection Control department on May, 2015.",
        "image": null
    },
    {
        "id": 55,
        "name": "Dr. Ahmed Sayeed",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Ahmed Sayeed graduated from Sir Salimullah Medical College, Dhaka in the year 1996. After his internship he took the rigorous path of post-graduation in Pediatrics. He completed his Diploma in Child Health (DCH) from Bangabandhu Sheikh Mujib Medical University in the year 2003 & obtained his fellowship (FCPS) in Pediatrics from Bangladesh College of Physicians and Surgeons (BCPS) in 2008. In his professional career he served many different medical institutions and government hospitals under Ministry of Health and Family Welfare across the country with dignity and reputation before joining Square Hospital. Dr. Sayeed went to Christian Medical College, Vellore, India in 2013 where he had hands-on training on different facets of management in Pediatric ICU. Following his return from the aforementioned institute, he was given the fulltime job of developing, remodeling the Pediatric ICU of Square Hospital & working as a treating consultant of this critical arena. He holds more than 10 years experience in the field of Pediatrics and Pediatric ICU.",
        "image": null
    },
    {
        "id": 56,
        "name": "Prof. Dr. Abdul Kader Shaikh",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Abdul Kader Shaikh Consultant of Neurology working in Square Hospital (part time) as a highly skilled neurologist. He is a medical graduate from Sher-e-Bangla Medical College under Dhaka University and obtained his professional degree FCPS (Internal Medicine) form Bangladesh College of Physicians and Surgeon (BCPS) in 1997 and MD (Neurology) from University of Dhaka, course conducted by Dhaka Medical College. Prof. Dr. Abdul Kader Shaikh started his career as Medical Officer. Then he worked as a Junior Consultant and after as a Senior Consultant. Presently, he is working as Associate Professor of Bangabandhu Sheikh Mujib Medical University (BSMMU). He is the consultant who obtained advanced training and acquired necessary expertise from different hospitals across the country. ?He has earned significant experience in medicine and neuromedicine and is highly competent in managing neuro patients.",
        "image": null
    },
    {
        "id": 57,
        "name": "Associate Prof. Dr. Sk. Mahbub Alam",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. SK. Mahbub Alam graduated from Rajshahi Medical College and achieved his professional degree MD (Neurology) from BSMMU. Afterwards, he moved to Malaysia for completing fellowship in Neuro-electrophysiology from University of Malaya, Malaysia. He is the first fellowship holder in Neuro electrophysiology in Bangladesh. ? Dr. Mahbub started his career in BSMMU in Emergency department in 1999. At present he is working as Associate Professor of Neurology and Neuro-Electrophysiology in Bangabandhu Sheikh Mujib Medical University (BSMMU) & he is a popular Electrophysiology teacher in Neuro-Electrophysiology.? Dr. Mahbub has attained advanced training and acquired the necessary expertise from different hospitals of Singapore, Thailand, Malaysia, Turkey, South Korea and Japan as well as in Bangladesh to provide complete neurological treatment for the wide spectrum of neurological diseases. He becomes a potential Neurologist and Neuro-electrophysiologist at Square Hospitals Ltd.",
        "image": null
    },
    {
        "id": 58,
        "name": "Dr. Rama Biswas",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. ?Rama Biswas obtained graduation from Sir Salimullah Medical College. Her passion to serve neuro-patient leaded her proceeding further education and gradually she achieved FCPS in Medicine from Bangladesh College of Physicians and Surgeons. She also succeeded to accomplish MD (Neurology) from Dhaka Medical College. She propelled herself for completing the comprehensive training in different functions of neuro-medicine. She received training from three renowned colleges, i.e. Dhaka Medical College, Sir Salimullah Medical Colllege, and Bangabandhu Sheikh Mujib Medical University (BSMMU). She persuaded her research work on demographics and comorbidity profile in migraine patients. ?A number of research works was published under her name in different medical journals.",
        "image": null
    },
    {
        "id": 59,
        "name": "Dr. Lutfun Nahar Begum",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Lutfun Nahar Begum graduated from Chittagong Medical College. After her internship she was trained at Bangabandhu Sheikh Mujib Medical University (BSMMU) in Pediatrics. She completed FCPS (Neonatology) degree from Bangladesh College of Physicians & Surgeons (BCPS). She acquired clinical fellowship in Neonatology from National University, Singapore and got experience from IPGMR, Chandighar, India in Neonatal Intensive Care Unit. Dr. Lutfun Nahar practiced in Bangladesh Government Health Service from Upazilla level. Later she joined the course of MD (Pediatrics) and obtained the degree of Doctor of Medicine (MD) in Pediatrics from Bangladesh Institute of Child Health. Dr. Lutfun Nahar worked in Dhaka Medical College Hospital and afterwards involved in Special Care Baby Unit (SCABU), BIRDEM. Before joining Square Hospital, she performed in Neonatology & Pediatrics unit of Apollo Hospital, Dhaka.",
        "image": null
    },
    {
        "id": 60,
        "name": "Prof. Dr. Jalal Uddin",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Jalal Uddin, with 25 years of experience in Cardiac Surgery is executing Open Heart Surgery, Coronary Artery Bypass Grafting (CABG), Congenital Heart Surgery and Combine Procedure of Coronary and Vascular Surgery at Square Hospital. Graduating from Rajshahi Medical College, Dr. Jalal Uddin joined there as Assistant Surgeon to perform in the department of Cardiac Surgery. Then, he completed PhD in Cardiovascular Surgery from National Center of Cardiovascular Diseases, Bulgaria. He also worked as a research Fellow in the Department of Cardiothoracic Surgery in St. Thomas Hospital, London, UK. Prof. Dr. Jalal enrolled at Cardiac Surgery Department of Chest Diseases Hospital, Kuwait for 7 years. A Few years later, he returned to Bangladesh and signed up with National Heart Foundation Hospital, Dhaka as Consultant and worked for 5 years. Then, he joined Ibrahim Cardiac Hospital & Research Institute as Senior Consultant and worked for 6 years. He was the Chief of Cardiac Surgery Department in Ibn Sina Specialized Hospital for 4 years.",
        "image": null
    },
    {
        "id": 61,
        "name": "Dr. Pratik Dewan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Pratik Dewan graduated from Sher-e-Bangla Medical College. ?He obtained MD (Internal Medicine) and DEM (Diploma in Endocrinology & Metabolism) from Bangabandhu Sheikh Mujib Medical University (BSMMU) respectively through BIRDEM Academy. He accomplished training in advanced Endocrinology from Singapore. He is a member of American Association of Clinical Endocrinologist (AACE), USA. He acquired training in Medicine from BSMMU and BIRDEM. Dr. Pratik worked in Endocrinology department of BIRDEM for 10 years. Later he assigned for Internal Medicine department and worked for more 5 years. In the professional tenure of BIRDEM, Dr. Pratik gains the proficiency in managing endocrinology and medicine patients.",
        "image": null
    },
    {
        "id": 62,
        "name": "Dr. Mahbub Mansur",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mahbub Mansur passed his MBBS from Chittagong Medical College in 1994. He passed MD in Cardiology from BSMMU in 2002. He attended Fellowship courses in Interventional Cardiology in Aga Khan University Hospital, Karachi and The Erasmus, Rotterdam, The Netherlands. He had done fellowship programmes in Electrophysiology in Holy Family Hospital, Bandra, Mumbai, India and also did fellowship programmes in Cardiac Device Implantation from Milan, Italy. He worked as a Consultant and Associate Professor in Ibrahim Cardiac Hospital and Research Institute from 2003 to 2012. From 2012 to mid-2016 he was the Chief Consultant Cardiologist in Ibn Sina Hospital, Dhanmondi. He is one of the pioneers of Radial Intervention in Bangladesh and till date has done more than 10,000 radial coronary intervention cases. His special interest is in Device therapies in Heart Failure patients. He is a life member of Bangladesh Cardiac Society and Bangladesh Society of Cardiac Intervention and a founder member of Bangladesh Heart Rhythm Society.",
        "image": null
    },
    {
        "id": 63,
        "name": "Dr. AKM Abu Mottaleb",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. AKM Abu Mottaleb graduated from Rangpur Medical College and after his Internship year he worked as Medical Officer in Dhaka Renal Centre & General Hospital. Later he joined as Assistant Registrar (Nephrology) in Medical College for Women and Hospital, Uttara and established a new dialysis unit. In 2003 he started serving as Assistant Registrar of Haemodialysis Unit at BIRDEM, Dhaka. He then moved to Kingdom of Saudi Arabia in the year 2004 and worked there under Ministry of Health. He was awarded BCLS certificate on 2006 from CPR Training Center, Al-Baha (in affiliation with Saudi & American Heart Association). Dr. Abu Mottaleb started serving Square Hospitals Ltd. since 2008. He has wide experience in different modalities of Renal Replacement Therapy. He was awarded MMedSci in Nephrology from University of Sheffield, United Kingdom in 2010. He has completed thesis works on ?Critical appraisal on the literature based on incidence and prevalence of Chronic Kidney Disease among general population?. He is also expert in general and interventional Nephrology. He is doing successfully all nephrology procedures like Real Time Kidney Biopsy, Dialysis catheter insertion including Tunnel Permcath, IPD catheter insertion etc. Dr. Mottaleb participated in many scientific seminar and international nephrology conference at home and in the abroad. He presented several scientific papers in the Sheffield Kidney Institute, United Kingdom. He is a life member of Bangladesh Society of Peritoneal Dialysis.",
        "image": null
    },
    {
        "id": 64,
        "name": "Dr. Musrat Rahman Deeba",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Associate Professor Dr. Musrat Rahman Deeba obtained her M.B.B.S. degree from Sir Salimullah Medical College. After completing her internship training she did further training in General Surgery in the same institution. Then she took admission in M.S. Pediatric Surgery course in Bangladesh Institute of Child Health and Dhaka Shishu Hospital under Dhaka University. She has completed her MS degree regularly and she is the 4th female Pediatric Surgeon in Bangladesh. After post graduation she obtained Resident Surgeon, Assistant Professor and Associate professor posts in different Hospital and private medical colleges in home and abroad. She has joined in Square Hospitals Limited on March, 2016 as Associate Consultant. She took advanced training in Pediatric Laparoscopic Surgery from Mumbai, India.",
        "image": null
    },
    {
        "id": 65,
        "name": "Dr. Raihan Rabbani",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Raihan Rabbani is a medical graduate from Dhaka Medical College. He completed FCPS degree in medicine from Bangladesh College of Physicians and Surgeons (BCPS) as one of the youngest doctor of his time. He got a rare chance of developing himself professionally by doing 3 years residency training in USA in his respective field. Dr. Raihan was trained in Sinai-Grace Hospital of Detroit Medical Center in Detroit, Michigan. He excelled in his training is USA & was awarded `Best Trainee of the Year? twice during his training. Critical Care Medicine was also an integral part of his training in USA. Certification as Diplomat of American Board of Internal Medicine added another bright feather to his cap. In Bangladesh, Dr. Raihan worked both in government hospital under Ministry of Health and Family Welfare and also private Apollo Hospitals Ltd as well. Currently he is working in Square Hospital as Consultant of Intensive Care Unit & Internal Medicine.",
        "image": null
    },
    {
        "id": 66,
        "name": "Dr. Pratik Dewan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Pratik Dewan graduated from Sher-e-Bangla Medical College. ?He obtained MD (Internal Medicine) and DEM (Diploma in Endocrinology & Metabolism) from Bangabandhu Sheikh Mujib Medical University (BSMMU) respectively through BIRDEM Academy. He accomplished training in advanced Endocrinology from Singapore. He is a member of American Association of Clinical Endocrinologist (AACE), USA. He acquired training in Medicine from BSMMU and BIRDEM. Dr. Pratik worked in Endocrinology department of BIRDEM for 10 years. Later he assigned for Internal Medicine department and worked for more 5 years. In the professional tenure of BIRDEM, Dr. Pratik gains the proficiency in managing endocrinology and medicine patients.",
        "image": null
    },
    {
        "id": 67,
        "name": "Dr. Rehnuma Jahan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Rehnuma Jahan obtained MBBS from Sylhet M A G Osmani Medical College and completed MS in Obstetrics & Gynecology from BSMMU. She worked at BIRDEM, Sylhet MAG Omani Medical College, Shaheed Sohrawardi Medical College under Ministry of Health and Family Welfare, Bangladesh in various capacities. Dr. Rehnuma took special training in Artificial Reproductive technique & laparoscopy from India & Singapore. She performed in the department of Obstetrics & Gynecology as well as Infertility at Apollo Hospital, Dhaka. Dr. Rehnuma is working at Square Hospital as a Consultant of department of Obstetrics & Gynecology & Square Fertility Centre from 2008. She attended many seminars & conferences on ObsGyn & Infertility within country & abroad.",
        "image": null
    },
    {
        "id": 68,
        "name": "Brig. Gen. Dr. Md. Delwar Hossain",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. (Dr.) Col. Md .Delwar Hossain graduated from Dhaka Medical College and started his career in combined military hospital under defense ministry. Then he successfully obtained his FCPS (Medicine) ?& FCPS (Gastroenterology) from BCPS. He achieved extensive training on Medicine and gastroenterology from Bangabandhu Sk. Mujib Medical University and Armed Forces Medical institute (AFMI) Bangladesh. He also gained advance training on interventional gastroenterology especially on ERCP from Lucknow, India. In his professional carrier he gained a wide exposure in the field of gastroenterology (Diagnostic & Therapeutic). At present he is working as Head of the Department of Gastroenterology in CMH and ?as Senior Consultant ? Gastroenterology at Square Hospital (Part time).",
        "image": null
    },
    {
        "id": 69,
        "name": "Dr. Sarabon Tahura",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Sarabon Tahura is a medical graduate (MBBS) from Mymensing Medical College under Dhaka University and obtained her professional degree FCPS (Paediatrics) from Bangladesh College of Physicians and Surgeon (BCPS). Afterwards, she completed fellowship in Paediatric Intervention Pulmonology from Qilu Children Hospital under Shangdong University, China. Dr. Sarabon Tahura started her career in Dhaka Shishu (Children) Hospital in 2006. At present she is working as Assistant Professor of Paediatric Respiratory Medicine in Dhaka Shishu (Children) Hospital. Dr. Sarabon Tahura has attained advanced training and acquired the necessary expertise from different hospitals of India, China as well as Bangladesh. She has earned significant experience in Paediatrics and Paediatric Respiratory Medicine and she is highly competent in managing different Paediatric Respiratory diseases including Pneumonia, Recurrent Respiratory tract infections, Brochiolitis, Broncheal Asthma, Allergy, Tuberculosis, Immunodeficiency and chronic lung diseases in children. Dr. Sarabon Tahura is the 1st Paediatric Interventional Pulmonologist in Bangladesh. She has earned significant experience and expertise in Paediatric Bronchoscopy for foreign body removal from airway and other interventions in children. A good number of original and review articles have been published under her name in different national and international medical journals. She was awarded in different international seminars.? Dr. Sarabon Tahura is a member of the American College of Chest Physician (ACCP) and World Association of Bronchology and Interventional Pulmonology (WABIP).",
        "image": null
    },
    {
        "id": 70,
        "name": "Dr. Kamal Pasha",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "\\N",
        "image": null
    },
    {
        "id": 71,
        "name": "Dr. Tanny Tarafder",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Tanny Tarafder graduated from Sir Salimullah Medical College, Dhaka. She pursued her career in Surgery and completed her surgical training in Mitford Hospital and Dhaka Medical College Hospital. She has been awarded Fellowship (FCPS, Surgery) by BCPS (Bangladesh College of? Physicians and Surgeons). To further increase her knowledge, she availed Membership (MRCS) of Royal College of Surgeons, UK.? She ?has considerable experience and expertise in General Surgery, especially in the areas of Breast and Colorectal diseases, hernia and laparoscopic? surgery. She is keen to modernizing the current surgical practice in our country by utilizing the latest protocols of diagnosis and surgical/nonsurgical management of diseases. She keeps herself updated by attaining? international seminars and training courses to constantly be with the? international standards. She excelled in the training course for the management of breast diseases at the Department of Endocrine Surgery in Christian Medical College (CMC), Vellore, India. She is a lifetime member of Association of Breast Surgeons of Bangladesh (ABSB), Asian Society of Mastology (ASOMA), and Society of Laparoscopic Surgeons of Bangladesh (SLSB). Breast Conserving Surgery and Laparoscopic Hernia Repair are two particular areas of interest for her. She attended workshop on Oncoplastic Breast Surgery in Pune, India, which was jointly conducted by International School of Breast Oncoplasty, Pune, India and University of East Anglia, UK. She has presented multiple papers in national and international conferences and has a number of publications to her credit.",
        "image": null
    },
    {
        "id": 72,
        "name": "Dr. Deepankar Kumar Basak",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Deepankar Kumar Basak graduated from Dhaka Medical College. After completing his internship from DMCH, he joined there as a? medical officer to pursue his post graduation in internal medicine. He got extensive training in internal medicine for 3 years at DMCH. He was also trained in chest medicine in NIDCH and Gastroenterology in DMCH. Dr. Deepankar obtained his FCPS in Internal Medicine from Bangladesh College of Physicians and Surgeons (BCPS).? He joined the Emergency Department of Square Hospital and worked there for more than 7 years under supervision of some internationally renowned emergency medicine specialists from CMC Hospital Vellore, India. Later, he has also worked in the department of Gastroenterology and now he is an Associated Consultant of Internal Medicine & Emergency Department.? Dr. Deepankar Kumar Basak has gathered huge experiences in managing Internal medicine, Emergency and Gastroenterology related patients both in IPD and OPD. He is an expert hand in Endoscopy & Colonoscopy too. He has actively joined in many seminars and symposiums in home and abroad and presented papers. He has published a number of articles in national and international medical journals and appreciated by the physicians. He is a lifetime member of Bangladesh Society of Medicine (BSM) & Bangladesh Gastroenterology Society (BGS).",
        "image": null
    },
    {
        "id": 73,
        "name": "Dr. Mohammad Israt Faisal",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mohammad Israt Faisal graduated from Rangpur Medical College with excellent academic record in the professional examinations. He started his carrier as a lecturer of anatomy and later joined BCS Health cadre. He completed his post graduation training in Rajshahi Medical College and obtained FCPS from Bangladesh College of Physician and Surgeon (BCPS). His professional history includes position such as resident surgeon and consultant at government hospital as well as specialist surgeon at reputed private hospital helped him to gain the experience of performing elective and emergency surgery, pre and post operative patient care. Dr. Mohammad Israt Faisal has got special interest in minimal invasive surgery and got advanced training in laparoscopic colorectal surgery from country and abroad. He has experience in working in cardiothoracic, thoracic and vascular surgery department. He is a life member of society of laparoscopic surgeons of Bangladesh.",
        "image": null
    },
    {
        "id": 74,
        "name": "Dr. Md. Mazharul Islam",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Md. Mazharul Islam graduated from Rajshahi Medical College. Then he joined BCS (Health) at Sylhet and thereafter BIRDEM Hospital. He obtained his FCPS (Ophthalmology) degree from BCPS & as post graduate Fellow he worked at BIRDEM till December, 2017. During this period he got intensive training on different aspects of clinical treatment of Ophthalmological diseases. Dr. Mazhar has a long experience of more than 12 years in the field of Ophthalmology. He has successfully done 2000 over cases of Phaco with PCIOL. He has accomplished other surgeries like Pterygium operation with conjunctival autograft, DCR operation with Intubation, Cyclocryopexy, Corneal injury repair & many more successfully.? At BIRDEM Hospital, Dr. Mazhar managed Diabetic & Hypertensive patients with great success. He has done more than 2500 Argon Laser in Diabetic retinopathy & around 500 YAG PI & YAG Laser capsulotomy in Glaucoma & Pseudophakia with PCO patients. He has 11 years of experience in Medical Retina. He has also completed advance training in SICS (Small Incision Cataract Surgery) from Islamia Eye Hospital on 2017. Dr Mazharul has been selected as life time member of OSB, BCPS, BAO & All India Ophthalmological Society (AIOS)",
        "image": null
    },
    {
        "id": 75,
        "name": "Dr. Arunangshu Das",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr Arunangshu Das passed MBBS from Mymensing Medical College in 2005 and completed internship training from the same institute in 2006. After his internship he decided to pursue his career in Oncology and joined Department on Radiotherapy of Dhaka Medical College and Hospital in 2007 as Honorary Medical Officer for initial training in Oncology. At the end of 2008 Dr Das received a scholarship and went to National Cancer Center (NCC) Singapore for a clinical attachment and fellowship training in Palliative Medicine. In 2009 Dr Arunangshu successfully completed Post Graduate Certificate in Palliative Medicine from Flinders University of Australia. Dr Arunangshu Das joined Government Health Service (27th BCS) in December 2008. Subsequently in 2010 he joined National Institute of Cancer Research and Hospital (NICRH), Dhaka as Assistant Registrar at the Department of Radiation Oncology. In 2012 he went to University Kebangsaan Malaysia (UKM) for a higher training in Oncology. Dr Arunangshu Das successfully completed FCPS in Radiotherapy from Bangladesh College of Physicians and Surgeons of Bangladesh (BCPS) in 2014. At the middle of 2014 he went to TATA Memorial Hospital Mumbai for a clinical training in Radiation Oncology. Dr Das successfully completed Basic Life Support ( BLS) and Advanced Cardiac Life Support (ACLS) from American Heart Association (AHA) in 2016. Dr Arunangshu Das attended training in Image Guide Radiation Therapy (IGRT) at TATA Medical Center Kolkata in may 2017. He also attended European Society of Medical Oncology Academy in August 2017 at Oxford University, UK. Dr Arunangshu Das received the prestigious International Development and Education Award (IDEA) in Oncology in January 2018 from American Society of Medical Oncology (ASCO) USA for the first time ever from Bangladesh. Dr Arunangshu Das is very active in clinical research and various academic activities. He has published various research articles in different medical journals both nationally and internationally. Dr Das is also active in Young Oncologists program of European Society of Medical Oncology (ESMO). Dr Arunangshu joined Square Hospitals Ltd in August 2014 and currently working at the Department of Radiotherapy and Oncology as Associate Consultant.",
        "image": null
    },
    {
        "id": 76,
        "name": "Dr. Md. Akhtanur Rahman Joarder",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Akhtanur Rahman Joarder obtained his MBBS from Faridpur Medical College and completed his MS in Cardio-Vascular & Thoracic surgery (CVTS) from National Institute of Cardio-vascular Diseases (NICVD). His works in Ibrahim Cardiac Hospital & Research Institute, Cardiac Centre of Ibn Sina Specialized Hospital and Square Hospital provides him wide experiences in various cardiac procedures ranging from conventional CABG, OPCAB, Mitral & Aortic valve replacements, repair of Atrial (ASD) & Ventricular septal defects (VSD), PDA ligation and intra-cardiac repair of TAPVC to Tetralogy of Fallot (TOF) surgery.  He independently manage & vascular conditions such as Acute vascular disease, Deep Vein Thrombosis, Chronic peripheral vascular diseases such as Buerger?s disease, Varicose veins, Chronic limb ischemia etc. He is also an expert in making Arterio-Venous (AV) fistula in patients of CKD. He can operate various types of cardiac tumors (myxoma), vascular tumors (hemangioma, AV malformation, pseudoaneurysm) & chest wall tumors.  Dr. A. R. Joarder is a life member of the Bangladesh Cardiac Society, Cardiac Surgeon?s Society of Bangladesh (CSSB), Bangladesh Association of Cardio-thoracic & Vascular Surgeons (BACTVS) & Bangladesh Medical Association (BMA).",
        "image": null
    },
    {
        "id": 77,
        "name": "Dr. Md. Sultan Sarwar Parvez",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Md. Sultan Sarwar Parvez graduated with MBBS degree from Jahurul Islam Medical College. He completed his Master?s (MS) in Cardio-Vascular & Thoracic Surgery (CV&TS) from National Institute of Cardiovascular Diseases (NICVD). He started his career as Medical officer in Cardiac Surgery in Heart & Chest Hospital, Dhaka. Then, he joined as Assistant Registrar, Cardiac surgery in Labaid Cardiac Hospital in 2008. Dr. Parvez was promoted subsequently to Registrar, Specialist & Junior Consultant at Labaid Cardiac Hospital. In 2012, he joined Cardiac Centre of Ibn Sina Specialized Hospital. He was appointed in the department of Cardio-Vascular Surgery of Square Hospital in 2016. His professional experience in cardiac surgery spans about 11 years.? Dr. Sarwar Parvez has been rigorously exposed to multiple types of routine & emergency cardiac operations such as conventional CABG, OPCAB Surgeries, Aortic valve replacement, Mitral valve replacement, Double valve replacement, Repair of Ventricular septal rupture, ASD & VSD closures, Intra-cardiac repair of TAPVC, Total correction of TOF, PDA ligation, Cardiac tumors (Myxoma), Chest wall tumors etc. He is also independently managing vascular diseases such as Deep vein thrombosis (DVT), varicose vein, Arterio-venous (AV) fistulas, vascular tumors like haemangioma, Arterio-venous malformation.? He is a member of Cardiac Surgeon?s Society of Bangladesh (CSSB) & Bangladesh Medical Association (BMA). He is also a member of Association of Thoracic and Cardiovascular Surgeons of Asia. Dr. Sarwar Parvez holds life membership of Bangladesh Association of Cardiovascular & Thoracic Surgeons.",
        "image": null
    },
    {
        "id": 78,
        "name": "Prof. Brig Gen (Retd.) Jahangir Alam",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Brig. Gen. (Retd) Jahangir completed MBBS from Rangpur Medical College. After one year of in-service training in Rangpur Medical College Hospital he joined in Army Medical Corps and became Graded Specialist in Radiology in Military in Dec 1982. Brig Gen Jahangir obtained MCPS in Radiology & Imaging in 1993 and FCPS in 1994. He did training in Angiographic X-ray equipment and Angiography in Japan, Australia, Indonesia and Thailand in 1994 and completed Fellowship in MRI (USA) in 1997. Prof. Jahangir Alam served 28 years in Military and became Head of the Department of Radiology & Imaging in CMH Dhaka till his deliberate retirement. ?He was promoted to the rank of Brig General, became Professor & Head of the Department of Radiology & Imaging in Armed Forces Medical College & CMH Dhaka. Prof. Jahangir has served 10 years private practice in Central Hospital Ltd and about 10 years in Apollo Hospitals Dhaka. He has lots of publications and has attended many National & International seminars as Speaker. He was honored with Visiting Professor of Pediatric Neuro-Radiology in Dhaka Shishu Hospital, Faculty?Urology & Transplant Foundation of Bangladesh. He is an examiner of FCPS, MD and M.Phil for last 13 years. He is a life member of Bangladesh Society of Radiology & Imaging (BSRI) and past Vice President of the Society. He has got advanced training in Pediatric Neuro-Radiology from Great Ormond Street Hospital for Children, London (UK), advanced training in Radiology & Imaging in Mount Elizabeth Hospital & Singapore General Hospital. ?",
        "image": null
    },
    {
        "id": 79,
        "name": "Dr. Subrata Kumar Barai",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Subrata Kumar Barai graduated from City Dental College under the University of Dhaka in 2003. After completing his internship he dedicated his training in the field of General Dentistry. He completed one year Post Graduation Training on Oral & Maxillofacial Surgery from BSMMU. Then he joined as a Medical Officer at HCDP of Diabetic Association of Bangladesh in 2006. During his professional service he achieved advanced training on Dental Surgery and Dental Implant Prosthesis from CMC Vellore, India. He is specialist in dealing with different oral and dental diseases, artificial replacement of missing teeth such as crown, bridge, implant & maxillofacial prosthesis and also expert in high tech endodontic procedures like root canal treatment & endodontic surgery. He joins Square Hospital as a highly skilled Oral & Dental Surgeon.  Experience: More than 12 years.",
        "image": null
    },
    {
        "id": 80,
        "name": "Dr. Md. Abdul Qader",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Md. Abdul Qader graduated from Sylhet MAG Osmani Medical College, Sylhet. After graduation, he has started his Pediatric training in Sylhet MAG Osmani Medical College Hospital. In the year 2010, he has joined in the department of Pediatric Nephrology, Bangabandhu Sheikh Mujib Medical University, Dhaka as a resident and obtained MD in Pediatric Nephrology. Dr. Qader has joined in the department of Pediatric Nephrology, Dialysis and Renal Transplantation, National University Hospital, Singapore as an IPNA (International Pediatric Nephrology Association) clinical fellow in 2016 and successfully completed a 2 year fellowship in October, 2018. He has vast experience in managing children with kidney disease in the neonatal and Pediatric ICU. He is experienced in clinical nephrology, Pediatric dialysis and renal transplantation. He has more than 20 publications in international, national medical journals and book. He has attended a number of national and international workshop, seminar and conferences and presented papers. He is an active member of International Pediatric Nephrology Association (IPNA) and American Society of Nephrology (ASN).",
        "image": null
    },
    {
        "id": 81,
        "name": "Dr. Fowaz Hussain Shuvo",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Fowaz Hussain graduated from Dhaka Medical College and obtained his MD (Hepatology) from Bangabandhu Sheikh Mujib Medical University (BSMMU). He gained experience through his working tenure of more than 10 years at department of Hepatology and Gastroenterology of a reputed corporate hospital of Dhaka where he groomed himself up as one of the dependable gastroenterologists of the country. He was also an Assistant Professor in the department of Hepatolgy at Mymensingh Medical College & Hospital. Dr. Fowaz Hussain is an expert in Interventional procedures like Endoscopy, Colonoscopy, Polypectomy, ERCP, Esophageal Stentings, Bleeding Homeostasis and Clippings. Dr. Fowaz Hussain got his advanced interventional training and joined many workshops in India, Singapore and different countries of Europe. He has many publications both in international and national levels.",
        "image": null
    },
    {
        "id": 82,
        "name": "DR. NASIMA AKTER",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Nasima Akter graduated from from Sir Salimullah Medical College, Dhaka. After completing internship and post graduation training, she started her career as Assistant Registrar in Pediatrics in Institute of Child & Mother Health (ICMH). She completed Diploma in Child Health (DCH) from Bangabandhu Sheikh Mujib Medical University (BSMMU) and was promoted as Registrar, Pediatrics. Dr. Nasima Akter obtained fellowship (FCPS) in Pediatrics from Bangladesh College of Physicians and Surgeons (BCPS). She serviced 12 years in the Institute of Child & Mother Health (IMCH) and involved in teaching of post graduate students. She had several training in neonatal resuscitation, breast-feeding, diarrheal diseases, integrated management of childhood illness, child health care, infant & young child feeding, and research methodology etc. Dr. Nasima Akter became master trainer of IMCI. ? With 19 years of successful career in pediatrics patient care, Dr. Nasima Akter joins at Square Hospitals Ltd. in 2010. She takes training in Pediatric Cardiology from National Institute of Cardiovascular Diseases (NICVD) and is evaluating and managing non-invasive pediatric cardiac patients from then. Her focus of interest is to the structural & congenital heart defect of neonates, infants, children & adolescents. She gives general pediatric treatment regularly. Dr. Nasima Akter has participated in many national and International conferences, and has presented and published papers. She is a member of Bangladesh Pediatric Association (BPA) & Pediatric Cardiac Society of Bangladesh (PCSB).",
        "image": null
    },
    {
        "id": 83,
        "name": "Prof. Md. Waziul Alam Chowdhury",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Md. Waziul Alam Chowdhury MBBS, FCPS (Psy) MACP (USA) is a Medical graduate from Rajshahi Medical College. After completion of internship he joined as a Medical officer and served as Assistant Professor, Associate Professor and Professor of Psychiatry in different Medical colleges and Institutions. In his successful carrier he gained advanced training in Geriatric Medicine & Psychiatry form India and also achieved (WHO) fellowship from there. He joins Square Hospital as Consultant- Psychiatry",
        "image": null
    },
    {
        "id": 84,
        "name": "Dr. Mahbub Hasan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mahbub Hasan graduated from Dhaka Medical College and started his career as an Assistant Surgeon. ?He obtained FCPS (General Surgery) from BCPS and then accomplished FCPS (Plastic Surgery) from the same Institute. He continued his training with advanced fellowship on hand and microsurgery from Wythenshawe Hospital, Manchester, UK and Royal Free Hospital, London. He visited Singapore for sophisticated training on burn management. He worked as a specialized registrar in plastic surgery department of Kuching General Hospital, Malaysia. He became Assistant Professor of burn and plastic surgery department at Dhaka Medical College Hospital. Dr. Mahbub is competent in management of burn; has good experience and skill in reconstruction of upper and lower limbs following trauma and cancer excision. He has special interest in facial trauma, body contouring and aesthetic surgery. He is competent of doing breast augmentation and breast lifting procedure.? He has participated in many seminars, symposiums in home and abroad and his articles have been published in different journals.",
        "image": null
    },
    {
        "id": 85,
        "name": "Dr. Md. O.F.G Kibria",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Md. O.F.G Kibria graduated from Dhaka Medical College and later did his MS in Orthopedic from National Institute of Trauma &Orthopedic Rehabilitation (NITOR), Dhaka. He also completed AO advance course in trauma from Malaysia. He worked in different hospitals of the world such as Sunny Brooks and Sick Kids Hospital, Toronto, Canada; Civil Hospital & Sterling Hospital, Ahmedabad; All India Institute, Delhi and Stanly Medical College, Chennai, India. ?He was trained in orthopedics and trauma surgeries including hip & knee replacements, arthroscopy, surgeries for hand and brachial plexus, congenital and post-polio deformities, free grafts, correction of deformities, nerve repair, tendon transfer and replantation. He has also worked at various district hospitals in Bangladesh. Dr. ?Kibria has over 20 years of experience as an Orthopedic Surgeon with expertise in the management of general orthopedic trauma, specially hand injury and brachial plexus injury and has performed the highest numbers of adult brachial plexus repair in the country with good results. Before joining Square Hospital, he worked as Consultant, Orthopedics at a corporate Hospital in Dhaka. Now he is consulting patients as a full time Consultant of Orthopedics ?in Square Hospital .",
        "image": null
    },
    {
        "id": 86,
        "name": "Dr. Md. Sirazul Haque Ershad",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Md. Sirazul Haque Ershad is an efficient neurosurgeon and neuro-interventionist who is specialized both in microvascular and endovascular surgeries. He was trained and supervised by the world famous Neuro interventionist and Neurosurgeons of both Bangladesh and India. Dr. ?Ershad was a direct student of National Professor Dr. Nurul Islam and completed graduation from IAHS, USTC. He entered into Post graduation in Neurosurgery in Dhaka Medical College, trained for both FCPS and MS degree in neurosurgery and obtained an MS Degree. After completing post-graduation, he was trained in Microvascular neurosurgery in Teishinki Hospital, Japan. He completed a yearlong fellowship in Neuro intervention in the Institute of Neuroscience (INK), India. Apart from open surgeries of brain and spine, he has special specialization in endovascular treatment of Stroke, Aneurysm, AVM, and DAVF.",
        "image": null
    },
    {
        "id": 87,
        "name": "Dr. Mohammad Abdullah Al Mamun",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mohammad Abdullah Al Mamun graduated from Mymensingh Medical College. He started his residency in general surgery and casualty surgery at Dhaka Medical College Hospital. After passing BCS (Health) he enrolled in the government service and later appointed as an Assistant Registrar of the Dept. of Surgery of Mymensingh Medical College Hospital. He spent two years at BSMMU and obtained FCPS in General Surgery from Bangladesh College of Physicians and Surgeons (BCPS) and achieved MRCS from Royal College of Surgeons of Edinburgh. He was awarded FMAS by Association of Minimal Access Surgeons of India. Dr. Mamun is the first Bangladeshi surgeon to be awarded prestigious fellowship in Colorectal Surgery by Association of Colon and Rectal Surgeons of India and obtained 3rd position in the FACRSI exam. With his effort and enthusiasm the first colorectal out-patient department in Govt. sector commenced working in the year 2013 at Shaheed Suhrawardy Medical College Hospital. He was invited as a guest faculty in a number of international conferences, symposiums ? and workshops at home and abroad. ? Dr. Mamun is the author of one book chapter on colorectal surgery (Benign Anorectal Disorders; Editors: Nisar Chowdri, Fazl Q. Parry, published by Springer). He has 18 years of experiences in the field of surgery with areas of expertise in Laparoscopic Surgery and treating diseases with minimal invasive techniques (Mini/Needle scopic Cholecystectomy/Appendicectomy). He has keen interest to treat diseases of the pelvic floor, colon, rectum and anus. Currently he is working as an Associate Professor of Surgery in a reputed Govt. Medical College and also available at Square Hospital as a part time Consultant of Colorectal and Laparoscopic Surgery. ?",
        "image": null
    },
    {
        "id": 88,
        "name": "Dr. Sadiqa Tuqan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Sadiqa Tuqan graduated from Mymensingh Medical College in 2005. Then she completed her training in Medicine from Mymensingh Medical College. Thereafter she endured her endocrinology training in BSMMU. She attained FCPS in Endocrinology and Metabolism in 2015. At present she is working as Associate Consultant of Endocrinology in Square Hospital. Dr. Sadiqa is a lifetime member of Bangladesh Endocrine Society and member of Association of Clinical Endocrinologist and Diabetologist Bangladesh.?",
        "image": null
    },
    {
        "id": 89,
        "name": "Prof. Dr. Rehana Parveen",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Rehana Parveen graduated from Sher-e-Bangla Medical College & stood first in order of merit in Final Prof Examination under University of Dhaka with Honors marks in Obs & Gyne in 1983. She obtained FCPS degree from Bangladesh College of Physicians & Surgeons (BCPS) in 1992. As a popular teacher she worked in many medical colleges such as, Dhaka Medical College, Chittagong Medical College, Mymensingh Medical College, Osmani Medical College, Suhrawardy Medical College & lastly in National Institute of Cancer Research & Hospital (NICR&H). She has vast experience in teaching & treating patients of Obgyn (including Gyne Oncology) for about 25 years & exerted her duties solely as Gynecological Oncologist for over 7 years. Before joining Square Hospital, she was Head, Department of Gyne Oncology in NICR&H, Mohakhali. Under her dynamic leadership training in Gyne Oncology has been recognized for 3 years in NICR&H by BCPS for FCPS Degree.? She took training in a good number of national & international institutes. She had post-graduate training on Gyne Oncology, Colposcopy & Cancer screening in BSMMU, Chittaranjan National Cancer Institute in Kolkata, Ethicon Institute in Mumbai, Nowrosjee Wadia Memorial Hospital in Mumbai, Tata Memorial Hospital in Mumbai, India, Turkish Health Institute, Ankara, Turkey. She has publication of about 18 articles, published in different national & international journals. She is a co-author of three popular books, named ?Clinical Guide to Obstetrics & Gynecology?. She is also an honorary contributor of ?Essence of Pediatrics? published by Elseviere from New Delhi.? Now she is consulting patients as a full time Consultant of Gynecological Oncology in Square Hospital.?",
        "image": null
    },
    {
        "id": 90,
        "name": "Prof. Dr. Brig. Gen. Md. Liakat Ali Hyder",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof (Dr.) Brig Gen Md Liakat Ali Hyder is a renowned orthodontist of Bangladesh. He completed his fellowship in Orthodontics and Dentofacial Orthopedics from Bangladesh College of Physicians and Surgeons. His practices focus not only on Orthodontics but also on general dentistry. Dr. Hyder commissioned as a proud member of Army Dental Corps in 1992. In his long and colorful service life Dr. Hyder dedicatedly served as a dental surgeon in different Combined Military Hospitals throughout the country. As a member of the United Nations he provided quality dental treatment to the distressed population of Liberia and Congo. His reputation as a dental surgeon in Kuwait Army has further enriched his experience in this arena. His fundamental research articles in various topics of Orthodontics has been published in different reputed national journals. Currently he is serving as the Commandant of Dhaka Military Dental Centre. Under his able guidance this institution became a centre of excellence for providing dental treatment. There he is also the departmental head of Orthodontics and Maxillofacial Orthopedics. He is now available in Square Hospital as a Consultant of Orthodontics and General Dentistry.",
        "image": null
    },
    {
        "id": 91,
        "name": "Dr. Arif Salam Khan",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Arif Salam Khan is a renowned Hepatobiliary surgeon. He is working in Bangabandhu Sheikh Mujib Medical University as an Associate Professor of Surgery. He completed MBBS from Dhaka Medical College in 1995. After completion of his Internship he joined Government Service in 17th BCS. Thereafter he did his surgery training at Sher-E-Bangla medical college hospital. He completed FCPS degree in Surgery from BCPS. Then he joined as Resident Surgeon (general) of Dhaka Medical College Hospital where he gained experience of doing all kinds of Emergency and Trauma Surgeries. Thereafter he left government job and joined Bangabandhu Sheikh Mujib Medical University as an Assistant Professor of Surgery. He worked in the Hepatobiliary Surgery department. Dr. Arif Salam Khan has got a number of trainings both locally and internationally. He participated in Basic Life Support Instructor Course, Advanced Cardiac Life Support Instructor Course, Fellowship Training on Emergency Medical Service and Disaster Medical Management System organized by KhonKaen Regional Hospital, Thailand which is WHO Collaborating Center for Injury Prevention and Safety Promotion. He is also a Trainer for Basic Surgical Skill of BCPS. He also successfully completed ATLS Provider Course and ATLS Instructor course and he is now regarded by the ATLS Program as an Instructor of Candidate. He also had an observational training on liver Transplant Surgery in MEDANTA Hospital, India. Dr. Arif Salam Khan is proficient in performing all kinds of General Surgeries. He has keen interest in doing Liver, Gall Bladder, Pancreas, Upper GI and Spleen Surgery for both benign and malignant conditions. He is also an expert in Laparoscopic Surgery.",
        "image": null
    },
    {
        "id": 92,
        "name": "Prof. Dr. Brig. Gen. Md. Azizul Islam",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Brig. Gen. Md. Azizul Islam is one of the most prominent psychiatrists of Bangladesh. He completed his fellowship from Bangladesh College of Physicians and Surgeons. He obtained advanced training in Chief Military Medical Academy, Ankara, Turkey and on Child and Adolescent psychiatry from National Institute of Mental Health and Neuroscience (NIMHANS), Bangalore, India. Beside those, he underwent many professional and academic trainings at home and abroad. For his outstanding activities in the field of mental health services in the country he was awarded with Fellowship from Royal College of Physicians (FRCP) and Fellowship from American College of Physicians (FACP). He was commissioned in Bangladesh army medical corps in 1986. He has been relentlessly working to build awareness, breaking stigma of mental illness. His work to manage Stress is widely accepted at home and abroad. Prof. Dr. Brig. Gen. Md. Azizul Islam is a regular writer in the national dailies in the field of mental health awareness. In his credit there are about 30 publications in national and international medical journals, 50 publications in the national dailies, weekly and health magazines. He wrote two books on mental health in Bengali named ?Moner Nana Rong O Mono Rog? & ?Sishu Kishor Mono Bikash Abong Autism?. He writes editorial for different prestigious medical journals. Besides practicing general and adult psychiatry he has keen interest in child and adolescent psychiatry specially autism. He is one of the pioneer child and adolescent psychiatrists in the country. Brig Gen Aziz is currently working as Professor & Head of the Dept. of Psychiatry, Armed Forces Medical College and Adviser specialist in Psychiatry at Combined Military Hospital, Dhaka Cantonment. He is now available in Square Hospital as a Consultant of Psychiatry.",
        "image": null
    },
    {
        "id": 93,
        "name": "Prof. Dr. Md. Hasan Masud",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Md. Hasan Masud, MBBS, MD (Gastroenterology)) is a medical graduate of Sher-e-Bangla Medical College, Barisal. ?After graduation he served in several reputed hospitals across the country and became Professor in the department of Gastroenterology at Bangabandhu Sheikh Mujib Medical University (BSMMU). Moreover 20 years of experience in the field of gastroenterology shapes him as an expert and very dependable gastroenterologist.?  In his successful carrier he gains wide range of advanced trainings and has taken special training in Interventional Gastroenterology from National University, Singapore. He performs all types of endoscopic procedures as he grooms himself with the 3rd space endoscopy training from Global Hospital, Mumbai, India and in therapeutic endoscopic ultrasound training from Shanghai, China. He has more than 50 publications both in international and national levels. ?",
        "image": null
    },
    {
        "id": 94,
        "name": "Dr. Major (Retd) Zeena Salwa",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Major (Retd) Zeena Salwa has completed her medical degree (MBBS) from Rangpur Medical College under Rajshahi University. She has post-graduation on Diploma in Child Heath (DCH) From Bangabandhu Sheikh Mujib Medical University (BSMMU) and also completed her highest degree FCPS (Pediatrics) from Bangladesh College of Physicians and Surgeons (BCPS). She started her carrier as Medical Officer in Bangladesh Army after internship training and served in Army Medical Corps (AMC) for 16 years in different cantonments as practicing physician with different leadership positions. She managed department of Pediatrics independently after her post-graduation degree in AMC and has extensive experiences in clinical patient management, counseling and prevention approaches. Dr. Zeena has expanded her career with Square Hospital Ltd (SHL) since 2010 as Pediatrician and expanded vision toward Pediatric Neurology for new services in SHL for responding the emerging needs of children in Bangladesh. She further received intensive clinical training in Pediatric Neurology from Dhaka Shishu Hospital and Christian Medical College (CMC), Vellore, India. Recently she has received training on Epilepsy and EEG from Cleveland Clinic, USA. Being a Consultant, she is performing individual and independent patient treatment and management both in critical and chronic illness of Pediatric patients including Pediatric Neurology. She has provided leadership for orchestrating a new service with establishment of Square Child Development Center (CDC) for addressing neurological disorders of children in 2017. She also introduced a new service for screening of ?Newborn??through Square (CDC). She has participated in many national and International conferences, presented and published papers. Her continued interest is in Pediatric Neurology including Developmental Pediatrics along with general Pediatrics. She is a member of national and international Pediatric associations and Pediatric Neurology associations as well.",
        "image": null
    },
    {
        "id": 95,
        "name": "Dr. Mohammad Abdullah Al Mamun",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mohammad Abdullah Al Mamun graduated from Mymensingh Medical College. He started his residency in general surgery and casualty surgery at Dhaka Medical College Hospital. After passing BCS (Health) he enrolled in the government service and later appointed as an Assistant Registrar of the Dept. of Surgery of Mymensingh Medical College Hospital. He spent two years at BSMMU and obtained FCPS in General Surgery from Bangladesh College of Physicians and Surgeons (BCPS) and achieved MRCS from Royal College of Surgeons of Edinburgh. He was awarded FMAS by Association of Minimal Access Surgeons of India. Dr. Mamun is the first Bangladeshi surgeon to be awarded prestigious fellowship in Colorectal Surgery by Association of Colon and Rectal Surgeons of India and obtained 3rd position in the FACRSI exam. With his effort and enthusiasm the first colorectal out-patient department in Govt. sector commenced working in the year 2013 at Shaheed Suhrawardy Medical College Hospital. He was invited as a guest faculty in a number of international conferences, symposiums ? and workshops at home and abroad. ? Dr. Mamun is the author of one book chapter on colorectal surgery (Benign Anorectal Disorders; Editors: Nisar Chowdri, Fazl Q. Parry, published by Springer). He has 18 years of experiences in the field of surgery with areas of expertise in Laparoscopic Surgery and treating diseases with minimal invasive techniques (Mini/Needle scopic Cholecystectomy/Appendicectomy). He has keen interest to treat diseases of the pelvic floor, colon, rectum and anus. Currently he is working as an Associate Professor of Surgery in a reputed Govt. Medical College and also available at Square Hospital as a part time Consultant of Colorectal and Laparoscopic Surgery. ?",
        "image": null
    },
    {
        "id": 96,
        "name": "Dr. Mohammed Rashedul Islam",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mohammed Rashedul Islam graduated from Chittagong Medical College and Hospital and was awarded fellowship in Plastic and Reconstructive Surgery (FCPS) from Bangladesh College of Physicians and Surgeons (BCPS). He was trained and awarded in plastic surgery from Alfred Hospital, Melbourne, Australia and St. Thomas Hospital and Guy?s Hospital, London.? Dr. Rashedul Islam is an Associate Professor and Consultant in the department of Plastic Surgery at BIRDEM. He administers and ensures medication, performs routine and emergency surgeries. He is also involved in teaching of ?undergraduate and postgraduate students since 2011 and was an instructor for Essential Management of Severe Burns. He also worked in Dhaka Medical College Hospital, National Institute of Traumatology and Orthopedic Rehabilitation (NITOR) and Acid Survivors Foundation.? Dr. Rashedul Islam has more than 15 years of experience in Plastic and Reconstructive Surgery and has publications in national and international journals.",
        "image": null
    },
    {
        "id": 97,
        "name": "Dr. Asif Manwar",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Asif Manwar, a graduate of Chittagong Medical College, started career as Resident Medical Officer, BIRDEM in 2002 en-route to Ibrahim Cardiac Hospital. ?Dr. Manwar pursued PG Dip Cardiology in 2004 under University of London with Distinction & Sir John Goodwin Prize for academic excellence by Imperial College London. Academic up-gradation in 2006 created an opportunity to serve Apollo Hospital Dhaka as Registrar, Cardiology. To aspire proficiency at masters? level he completed MSc Cardiology with Distinction once again by Canterbury Christ Church & University College London (UCL) in 2008. To achieve superspeciality, he opted Fellowship in Paediatric Cardiology being registered with Medical Council of India in 2009. ? ? ? ? ?? Dr. Manwar is proficient in all facets of non-invasive procedures like 3D-TOE-DSE, Dyssynchrony, Strain Rate, Tissue Doppler Imaging, Contrast & Intra-operative Echo. He got basic training from Hammersmith, Royal Brompton and advanced training from The Heart Hospital London. He obtained hands on training in Grown-Up Congenital, Paediatric, Neonatal & Fetal Echo from AMRITA Kerala & New Delhi India.? Dr. Asif Manwar joined SQUARE Hospital as Specialist Cardiologist, contributing his expertise since then before taking up position of Associate Consultant in 2015 & Coordinator Non-Invasive Lab in 2017. ??",
        "image": null
    },
    {
        "id": 98,
        "name": "Dr. S.M Shahedul Amin (Robin)",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. S.M. Shahedul Amin (Robin) completed his graduation from Sher-e-Bangla Medical College, Barisal and completed post graduation in DIP Cardiology from National Institute of Cardiovascular Disease under BSMMU. He gained fellowship from Fortis ESCORTS Heart Institute, New Delhi, India and achieved advanced Echo skills through training from the reputed Echo training institute, JROP, New Delhi.? His carrier began in Z.H Sikder Medical College Hospital, Dhaka and served there as Cardiac Intensivist. He also worked in CCU of ARAR Central Hospital, KSA. After serving for one year in KSA he joined at Square Hospitals Ltd. and now he is rendering his service as Associate Consultant, Cardiology (Non-Invasive). ? Dr. Robin is expertise in non invasive cardiological procedures expand from 2D-3D Echocardiology (Adult & Paediatric), Trans oesophageal Echo (TEE), Dobutamin stress Echo (DSE) and to other stress Echoes. Tissue Doppler imaging, Strain rate, Contrast Echo and intra operative Echo are his area of interest.? During his successful carrier in Cardiology of 19 years, Dr. Robin served in the field of critical care area (CCU) for 13 years and willing to serve many more years in the field of Cardiology.",
        "image": null
    },
    {
        "id": 99,
        "name": "DR. NASIMA AKTER",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Nasima Akter graduated from from Sir Salimullah Medical College, Dhaka. After completing internship and post graduation training, she started her career as Assistant Registrar in Pediatrics in Institute of Child & Mother Health (ICMH). She completed Diploma in Child Health (DCH) from Bangabandhu Sheikh Mujib Medical University (BSMMU) and was promoted as Registrar, Pediatrics. Dr. Nasima Akter obtained fellowship (FCPS) in Pediatrics from Bangladesh College of Physicians and Surgeons (BCPS). She serviced 12 years in the Institute of Child & Mother Health (IMCH) and involved in teaching of post graduate students. She had several training in neonatal resuscitation, breast-feeding, diarrheal diseases, integrated management of childhood illness, child health care, infant & young child feeding, and research methodology etc. Dr. Nasima Akter became master trainer of IMCI. ? With 19 years of successful career in pediatrics patient care, Dr. Nasima Akter joins at Square Hospitals Ltd. in 2010. She takes training in Pediatric Cardiology from National Institute of Cardiovascular Diseases (NICVD) and is evaluating and managing non-invasive pediatric cardiac patients from then. Her focus of interest is to the structural & congenital heart defect of neonates, infants, children & adolescents. She gives general pediatric treatment regularly. Dr. Nasima Akter has participated in many national and International conferences, and has presented and published papers. She is a member of Bangladesh Pediatric Association (BPA) & Pediatric Cardiac Society of Bangladesh (PCSB).",
        "image": null
    },
    {
        "id": 100,
        "name": "Dr. Manjuma Rahman",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Manjuma Rahman obtained her MBBS degree from Mymensingh Medical College in the year of 1999 & has completed internship from the same institution. She has got MD on Transfusion Medicine from Bangabandhu Sheikh Mujib Medical University (BSMMU) in 2010. Earlier she worked as Registrar of medicine in University Dental College, Dhaka. She has been working at Square Hospital since 2006.? Dr. Manjuma Rahman works as a Consultant of Blood bank and has been looking after the day to day affairs of Blood Bank. This includes donor selection, Blood letting, component preparation, Blood Bank testing, Apheresis procedure and Patient?s Blood Transfusion. She is also competent in supervising Therapeutic Plasma Exchange Procedures. She is an exceptional Transfusion Medicine expert who has gained tremendous exposure and experience in modern blood banking. She has national & international Publications in related field. She was awarded in different international seminars. She is a member of Asian Association of Transfusion Medicine (AATM), Blood transfusion Society of Bangladesh (BTSB) and Bangladesh Medical Association (BMA",
        "image": null
    },
    {
        "id": 101,
        "name": "Dr. Mahmuda Zaman",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Mahmuda Zaman graduated from Dhaka Medical College in 1999 & served Bangladesh Armed Forces as medical officer in different Combined Military Hospitals till 2008. To pursue her career in Pediatrics she underwent full time residential training in the department of Pediatrics at Dhaka Medical College & ?Bangabandhu Sheikh Mujib Medical University. She achieved FCPS in Pediatrics in 2011 from Bangladesh College of Physicians & Surgeons. She also pursued International Fellowship in Pediatric Hematology Oncology from CMC Vellore, India. Dr. Mahmuda is trained extensively in Pediatric Hemato-Oncology & has gained wide experience in managing benign & malignant Hematology including emergencies in Pediatric Hemato-Oncology, Chemotherapy & important Hematological procedures. She has participated in various seminars & symposiums on Hematology at home and abroad and has a number of publications to her credit in reputed medical journals. She has joined Square Hospital as Associate Consultant, Pediatric Hemato-Oncology.",
        "image": null
    },
    {
        "id": 102,
        "name": "Prof. Dr. Md. Siraj Uddin",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Prof. Dr. Md. Siraj Uddin completed his graduation from Sylhet MAG Osmani Medical College in 1982. After finishing his internship he joined as medical officer under Ministry of Health, Bangladesh. He worked as a Professor & Head of the Department of Dermatology at Sylhet M.A.G. Osmani Medical College till 2008 & then at ?Sylhet Women?s Medical College from 2008 to 2016. He completed Diploma in Dermatology (DD) from Institute of Dermatology Bangkok, Thailand & then Diploma in Dermatology & Venereology (DDV) from BSMMU, Dhaka. He achieved Fellowship in Laser & Dermatosurgery from Institute of Dermatology & Ramathibody Laser Center, Bangkok, Thailand & Fellowship in Hair Restoration Surgery from Mount Sinai Hospital, New York University, USA.? Prof. Dr. Md Siraj Uddin is skilled & experienced in managing allergy and skin diseases, sexual medicine, cosmetic surgery, vitiligo surgery, laser and hair transplant surgery, slimming and body shaping, Botox & Fillers etc. He received trainings on Laser & Aesthetic Skin Therapy from Harvard Medical School, Boston, USA; Male sexual health from Bangkok; Laser Assisted Liposuction from Milan, Italy; Hair Transplant Surgery from USA, France, Korea & India and participated in many international workshops, seminars & conferences at USA, Switzerland, Australia, France, Canada, Malaysia, India etc. His research articles have been published in many national & international journals. He joined at ?Square Hospital as Senior Consultant, Clinical & Aesthetic Dermatology.",
        "image": null
    },
    {
        "id": 103,
        "name": "Dr.Sultan Reza",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr.Sultan Reza graduated from Jahurul Islam Medical College and Hospital , Bangladesh. After graduation, he started his career as Medical Officer in the department of Anaesthesia and ICU in the same institute. He got academic training in ?Anaesthesia, Pain and ICU from BIRDEM General hospital and Ibrahim Cardiac Hospital. In this process, he passed Diploma in Anesthesia (DA) from BIRDEM General Hospital. He obtained his fellowship (FCPS) in Anesthesia from Bangladesh college of Physicians and Surgeons (BCPS).? Dr.Sultan worked as an Honorary Full Time Registrar in the department of Neuro Trauma ICU in Christian Medical College, Chennai, Vellore, India. Since 2011, He has been serving at Square Hospitals Ltd as Specialist Anesthesiology and continuing his service as an Associate Consultant-Neuro ICU from March 2019. Currently he is working as an in-charge of COVID-19 ICU.?",
        "image": null
    },
    {
        "id": 105,
        "name": "Dr. Prasanta K Chanda",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Prasanta K Chanda, Senior Consultant & Associate Professor, Department of Cardiac Surgery of National Heart Foundation Hospital & Research Institute has joined Square Hospital as a Senior Consultant of Cardiac Surgery Department. He has 20 years of experience and skills to perform a wide array of cardiac surgeries like Beating Heart Coronary Artery Bypass Surgeries (CABG), Minimally Invasive Cardiac Surgery (MICS), Redo or repeat cardiac surgery, Aortic surgery-specially Bentall, David procedure, Total Arch Replacement, FET (Frozen Elephant Trunk) etc. He is one of the pioneers of MICS & Aortic Surgery program in Bangladesh. ? He had his graduation (MBBS) from Sir Salimullah Medical College and obtained his Masters on Cardiovascular and Thoracic Surgery from National Institute of Cardio-vascular Diseases (NICVD). He served different Govt. and private institutes before joining National Heart Foundation Hospital and Research Institute in 2006 as Assistant Professor cum Consultant of Cardiac Surgery. In August, 2010 he was promoted to his present position - Associate Professor cum Senior Consultant of Cardiac Surgery. ?? Dr. Prasanta got the opportunity to work as a fellow/ observer in the Department of Cardiothoracic Surgery at All India Institute of Medical Sciences, New Delhi, India; Cardiac Institute, National University Hospital, Singapore; Houston Methodist DeBakey Heart & Vascular Center, Houston, USA; Cleveland Clinic, Ohio, USA and many others. He has lots of publications in national & international journals. ? Presently he is serving as Vice President, Cardiac Surgeons Society of Bangladesh (CSSB). He is also member of BMA, Bangladesh Cardiac Society, IACTS, SMICTSI, STS, EACTS, ISMICS.",
        "image": null
    },
    {
        "id": 106,
        "name": "Dr. Farzana Shumy",
        "yearOfExperience": 15,
        "specialities": "Anesthesiology",
        "degrees": "MBBS FCPS",
        "description": "Dr. Farzana Shumy is a medical graduate from Mymensingh Medical College. She obtained her FCPS in Medicine from Bangladesh College of Physicians & Surgeons and achieved MRCP from Royal Colleges of Physicians of the United Kingdom. ? Dr. Farzana has worked in the department of medicine in Sir Salimullah Medical College, Mitford hospital, and Dhaka Medical College & Hospital. She later joined the department of internal medicine at Bangabandhu Sheikh Mujib Medical University (BSMMU). She obtained her MD (Rheumatology) from BSMMU and later continued her service at the department of Rheumatology of BSMMU. She has acquired special training on Musculoskeletal ultrasound and capillaroscopy from the European Union League Against Rheumatism (EULAR) and is one of the few specialists in these advanced procedures in Bangladesh.? She has presented a number of topics in multiple national & international seminars and more than 25 published papers in national & international journals. She has joined Square Hospital as Associate Consultant- Rheumatology and Internal Medicine.",
        "image": null
    }
]